/*/////////////////////////////////////////////////
Dx2 Devil Fusion Emulator
Author: Robin Chiu
E-mail: oceanxdds@gmail.com
Github: https://github.com/oceanxdds/dx2_fusion
Publish: https://oceanxdds.github.io/dx2_fusion/
//////////////////////////////////////////////////*/

const start_stamp = new Date();

// Digital Devil Data (Stable Version)

const ddd_stable = [
    {
        name:'大天使',
        formulas:[
            ['神獸','女神'],
            ['神獸','魔神'],
            ['聖獸','女神'],
            ['天使','女神'],
            ['天使','聖獸'],
            ['墮天使','聖獸']
        ],
        devils:[
            {   name:'メタトロン',       name_tw:'梅塔特隆', name_en:'Metatron',   rarity:5,   grade:99,  icon:'daitensi_metatoron.png',  skills:['天罰','無限のチャクラ','シナイの神火'], skill4:['不屈の闘志','マハンマダイン','メシアライザー','二分の魔脈','電撃反射'], skill5:['','吸魔','マハポイズマ','マハジオダイン','マハラギダイン'], elements:['','耐','耐','耐','耐','無',''], type:"攻擊"     },
            {   name:'ミカエル',        name_tw:'米迦勒',      rarity:5,    grade:90, icon:'daitensi_mikaeru.png', skills:["勝利の息吹","天罰","メギドラオン"], skill4:["食いしばり","裁きの雷火","メディアラハン","地獄のマスク","呪殺反射"], skill5:['','ティタノマキア','火炎耐性','ジオダイン','刹那五月雨撃ち'], elements:["","","無","無","","反","弱"], type:"攻擊"     },
            {   name:'アズラエル',      name_tw:'阿斯萊爾',    rarity:4,    grade:67, icon:'daitensi_azuraeru.png', skills:["テトラカーン","イービルアイ","アギダイン"], skill4:["マカラカーン","ムドダイン","祟り","マカラカシフト","呪殺無効"], skill5:["","甘噛み","デクンダ","野獣の勘","審判の光"], elements:["耐","耐","弱","","","反","耐"], type:"支援"            },
            {   name:'サンダルフォン',   name_tw:'聖達芬',     rarity:4,           grade:61, icon:'daitensi_sandaruhuon.png', skills:["ハマダイン","ザンダイン","スクカオート"], skill4:["アムリタ","マハンマオン","サマリカーム","野獣の勘","衝撃耐性"],skill5:["","メポズムディ","反撃","ラクンダ","メガトンプレス"], elements:["耐","","","耐","","反","無"], type:"攻擊"         },
            {   name:'ライラ',          name_tw:'萊拉',    rarity:3,           grade:43, icon:'daitensi_raira.png', skills:["メディラ","破魔ブースタ","マハンマオン"], skill4:["マカジャマオン","ハマダイン","リカーム","勝利の息吹","電撃耐性"],skill5:["","ザン","マハザン","ヒートウェイブ","ブフ"], elements:["","","","弱","耐","無","弱"], type:"攻擊"          }
        ]
    },
    {
        name:'女神',
        formulas:[
            ['靈鳥','大天使'],    //180419 add
            ['魔神','靈鳥'],      //180419 add
            ['聖獸','大天使'],
            ['聖獸','神獸'],
            ['幻魔','靈鳥'],      //180419 add
            ['地母神','魔神'],
            ['地母神','幻魔'],
            ['天使','大天使'],
            ['墮天使','天使'],
            ['鬼女','大天使'],
            ['鬼女','神獸'],
            ['鬼女','地母神'],
            ['鬼女','妖精']
        ],
        devils:[
            {                name:'ラクシュミ',         name_tw:'吉祥天',       rarity:5,                grade:85, icon:'megami_rakusyumi.png', skills:["ディアラハン","ツイスター","セクシーダンス"], skill4:["二分の魔脈","殺風激","マカラカーン","狂い咲き","衝撃無効"], skill5:["","甘噛み","ジオダイン","虚弱無効","毒針"], elements:["","","","","弱","耐","無"], type:"支援"            },
            {                name:'イシュタル',        name_tw:'伊絲塔',        rarity:5,                grade:82, icon:'megami_isyutaru.png', skills:["マハンマオン","ディアラハン","ジャッジメント"], skill4:["サマリカーム","裁きの雷火","コンセントレイト","テトラカシフト","衝撃無効"], skill5:["","ゴッドハンド","毒床渡り","デクンダ","アギラオ"],elements:["","","","無","弱","無","弱"], type:"回復"            },
            {                name:'サラスヴァティ',    name_tw:'妙音天女',            rarity:4,                grade:69, icon:'megami_sarasuvatei.png', skills:["マハブフーラ","バリア","静寂の祈り"], skill4:["ブフダイン","絶対零度","メディラマ","追い打ち","氷結反射"],skill5:["","メチャームディ","呪い耐性","ミナゴロシの愉悦","イービルアイ"], elements:["","弱","無","","","","弱"], type:"支援"            },
            {                name:'パラスアテナ',      name_tw:'帕拉斯雅典娜',          rarity:4,                grade:62, icon:'megami_parasuatena.png', skills:["衝撃耐性","刹那五月雨撃ち","天罰"], skill4:["マカラカーン","モータルジハード","ディアラハン","勝利のチャクラ","火炎無効"],skill5:["","五月雨斬り","静寂の祈り","毒針","ツイスター"], elements:["耐","","","","","無","弱"], type:"攻擊"            },
            {                name:'スカアハ',          name_tw:'斯卡哈',      rarity:3,                grade:50, icon:'megami_sukaaha.png', skills:["ザンマ","冥界破","ウィンドブレス"], skill4:["二分の活泉","狂乱の剛爪","ディアラマ","地獄のマスク","電撃耐性"],skill5:["","ブフ","反撃","自然治癒","暴れまくり"], elements:["","","","弱","無","耐",""], type:"攻擊"            },
            {                name:'アリアンロッド',     name_tw:'阿麗安蘿德',           rarity:3,                grade:44, icon:'megami_arianrodo.png', skills:["ハマオン","メディア","怪力乱神"], skill4:["ディアラ","刹那五月雨撃ち","リディアコワース","千発千中","氷結無効"],skill5:["","マハジオ","チャームディ","初段の恵体","クロズディ"], elements:["耐","","","","","耐",""], type:"攻擊"            },
            {                name:'ハトホル',          name_tw:'哈索爾',      rarity:2,                grade:27, icon:'megami_htohoru.png', skills:["アムリタ","ザン","ジオンガ"], skill4:["メポズムディ","マハジオ","メチャームディ","一分の魔脈","衝撃無効"], skill5:["","ディア","初段の猛速","チャームディ","メウィークディ"],elements:["弱","","耐","","耐","耐",""], type:"回復"            }
        ]
    },
    {
        name:'靈鳥',              //180419 add
        formulas:[
            ['神獸','大天使'],
            ['天使','神獸'],
            ['妖魔','女神'],
            ['魔獸','神獸'],
            ['妖精','龍王'],
            ['妖精','魔獸'],
            ['鬼女','聖獸'],
            ['夜魔','妖鬼'],
            ['邪神','夜魔'],
            ['妖獸','妖魔'],
            ['妖獸','龍王'],
            ['魔王','妖魔']
        ],
        devils:[
            {                name:'ガルーダ',         name_tw:'迦樓羅',       rarity:5,                grade:80, icon:'reityou_garuda.png', skills:["ザンダイン","ラクンダオート","ヴァーハナ"], skill4:["三段の賢魔","マハラギダイン","フォッグブレス","狂戦士","破魔無效"], skill5:["","マハマカジャマ","アムリタ","火炎ブースタ","アギラオ"], elements:["","反","弱","","無","耐",""], type:"攻擊"            },
            {                name:'ヤタガラス',         name_tw:'八咫烏',       rarity:4,                grade:66, icon:'reityou_yatagarasu.png', skills:["冥界破","スクンダオート","スピードスター"], skill4:["物理ブースタ","モータルジハード","スクカジャ","寸分の見切り","物理耐性"], skill5:["","マハラギオン","一分の魔脈","ウィンドブレス","緊縛耐性"], elements:["","無","弱","","","耐",""], type:"支援"            },
            {                name:'スザク',         name_tw:'朱雀',       rarity:3,                grade:53, icon:'reityou_suzaku.png', skills:["アギラオ","タルンダオート","メディラマ"], skill4:["ダークゾーン無効","マハンマ","バインドボイス","毒床渡り","物理耐性"], skill5:['','コロシの愉悦','クロズディ','メパララディ','ジオ'], elements:["弱","無","弱","","","",""], type:"回復"            },
            {                name:'ジャターユ',         name_tw:'佳塔由',       rarity:3,                grade:44, icon:'reityou_jatayu.png', skills:["スクカジャ","スクカオート","デカジャ"], skill4:["スクンダ","デスバウンド","リカーム","野獣の勘","電撃耐性"],skill5:["","マハザン","乱れ狂い","メポズムディ","カースディ"], elements:["","耐","","弱","吸","無","弱"], type:"支援"            },
            {                name:'スパルナ',         name_tw:'金翅鳥',       rarity:2,                grade:28, icon:'reityou_suparuna.png', skills:["ジオ","金剛発破","ラクカジャ"], skill4:["ディアラ","吸魔","タルンダ","地獄のマスク","電撃無効"],skill5:["","クロズディ","百発百中","ムド","突撃"], elements:["","","","耐","","耐","弱"], type:"攻擊"            },
            {                name:'ハンサ',         name_tw:'漢薩',       rarity:2,                grade:24, icon:'reityou_hansa.png', skills:["ハマ","ジオンガ","スクカジャ"], skill4:["マカジャマ","マハンマ","メディア","スピードスター","氷結耐性"],skill5:["","ディア","ジオ","ポズムディ","なぎ払い"], elements:["","","","耐","","","弱"], type:"支援"            }
        ]
    },
    {
        name:'魔神',
        formulas:[
            ['女神','大天使'],
            ['靈鳥','女神'],      //180419 add
            //['神獸','大天使'],     //180419 remove
            ['破壞神','女神'],
            ['地母神','大天使'],
            ['魔獸','大天使'],
            ['墮天使','魔獸'],
            ['妖鬼','鬼神'],
            ['夜魔','墮天使'],
            ['邪神','神獸'],
            ['邪神','魔獸']
        ],
        devils:[
            {                name:'ヴィシュヌ',      name_tw:'毘濕奴',          rarity:5,                grade:97, icon:'majin_visyunu.png', skills:["ブフダイン","天罰","アヴァターラ"], skill4:["ムドダイン","メギドラオン","常世の祈り","虚弱無効","呪殺反射"], skill5:["","モータルジハード","魔封耐性","ウィンドブレス","ハマオン"],elements:["","弱","吸","","","無","無"], type:"攻擊"            },
            {                name:'アマテラス',      name_tw:'天照',          rarity:5,                grade:82, icon:'majin_amaterasu.png', skills:["マハラギオン","タルンダ","天孫降臨"], skill4:["スクカオート","トリスアギオン","メディアラハン","三段の賢魔","電撃無効"], skill5:["","ジュオン","魅了無効","ラクカジャ","スクンダ"],elements:["","反","","弱","","耐",""], type:"支援"            },
            {                name:'オーディン',      name_tw:'奧丁',          rarity:4,                grade:73, icon:'majin_odein.png', skills:["氷結耐性","ショックウェーブ","グングニル"], skill4:["無慈悲な一撃","メガトンレイド","タルカジャ","千発千中","呪殺無効"], skill5:["","イービルアイ","マハラギ","ブフーラ","ポズムディ"],elements:["","","","反","弱","耐","耐"], type:"攻擊"            },
            {                name:'プロメテウス',    name_tw:'普羅米修斯',            rarity:4,                grade:67, icon:'majin_purometeusu.png', skills:["火炎ブースタ","マカラカシフト","アギダイン"], skill4:["三段の恵体","マハラギダイン","リカームドラ","無限のチャクラ","火炎吸収"], skill5:["","電撃耐性","マハザンマ","乱れ狂い","毒耐性"],elements:["","無","弱","","","耐",""], type:"攻擊"            },
            {                name:'ミトラ',         name_tw:'密特拉',       rarity:3,                grade:55, icon:'majin_mitora.png', skills:["マハジュ","バリアコワース","イービルアイ"], skill4:["メギド","マハンマオン","フォッグブレス","狂い咲き","衝撃耐性"], skill5:["","メディア","ディア","マハジオ","初段の恵体"],elements:["反","","弱","","","耐","耐"], type:"支援"            },
            {                name:'ホルス',         name_tw:'荷魯斯',       rarity:3,                grade:49, icon:'majin_horusu.png', skills:["ディアラマ","デクンダ","マハンマ"], skill4:["二分の魔脈","ハマダイン","アムリタ","破魔ブースタ	","電撃無効	"], skill5:["","カースディ","パララディ","マハラギ","カースディ"],elements:["耐","","","","","反","弱"], type:"回復"            }
        ]
    },
    {
        name:'神獸',
        formulas:[
            ['聖獸','魔神'],
            ['地母神','聖獸'],
            ['龍王','幻魔'],
            ['魔獸','魔神'],
            ['魔獸','聖獸'],
            ['魔獸','破壞神'],
            ['夜魔','妖魔'],
            ['邪神','魔神'],
            ['妖獸','靈鳥'],      //180419 add
            ['妖獸','邪神'],
            ['外道','聖獸']
        ],
        devils:[
            {                name:'バロン',         name_tw:'巴隆',       rarity:5,                grade:84, icon:'sinjyuu_baron.png', skills:["マハジオンガ","ショックウェーブ","バロンダンス"], skill4:["食いしばり","真理の雷","リカームドラ","電撃ハイブースタ","呪殺無効"], skill5:["","ブフダイン","マハシバブー","二段の恵体","マカジャマ"],elements:["耐","","","無","弱","無","弱"],type:"支援"           },
            {                name:'アヌビス',       name_tw:'阿努比斯',         rarity:4,                grade:70, icon:'sinjyuu_anubisu.png', skills:["呪殺ブースタ","ムドダイン","審判の光"], skill4:["デクンダ","煉獄","テトラカーン","無慈悲な一撃","呪殺無効"], skill5:["","吸魔","ポイズマ","ディア","アギラオ"],elements:["","","","","","無","耐"],type:"攻擊"            },
            {                name:'キマイラ',       name_tw:'奇美拉',         rarity:3,                grade:49, icon:'sinjyuu_kimaira.png', skills:["マカラコワース","ジオンガ","狂乱の剛爪"], skill4:["怪力乱神","マハジオンガ","雄叫び","猛反撃","衝撃耐性"], skill5:["","パララディ","マハンマ","メディア","自然治癒"],elements:["","耐","","耐","弱","",""],type:"支援"            },
            {                name:'マカミ',         name_tw:'真神',       rarity:3,                grade:41, icon:'sinjyuu_makami.png', skills:["メパララディ","緊縛無効","ディアラマ"], skill4:["アムリタ","怪力乱神","サマリカーム","回復ブースタ","電撃無効"], skill5:["","パララディ","マハザン","ディア","アギ"],elements:["","","","","","耐","弱"],type:"回復"            },
            {                name:'シーサー',       name_tw:'獅爺',         rarity:2,                grade:33, icon:'sinjyuu_sisa.png' , skills:["シバブー","ザン","ウィンドブレス"], skill4:["バインドクロー","マハザン","バリアコワース","緊縛追撃","氷結耐性"], skill5:["","ブフ","アギ","百発百中","ジオ"],elements:["","耐","","","耐","耐",""],type:"支援"           }
        ]
    },
    {
        name:'聖獸',
        formulas:[
            ['神獸','靈鳥'],      //180419 add
            ['破壞神','神獸'],
            ['鬼神','神獸'],
            ['天使','幻魔'],
            ['妖魔','破壞神'],
            ['魔獸','鬼神'],
            ['妖精','大天使'],
            ['妖精','天使'],
            ['妖精','妖魔'],
            ['夜魔','神獸'],
            ['夜魔','幻魔'],
            ['妖獸','女神'],
            ['幽鬼','妖精']
        ],
        devils:[
            {                name:'スフィンクス',     name_tw:'斯芬克斯',           rarity:4,                grade:76, icon:'seijyuu_sufuinkusu.png', skills:["バリア","テトラカシフト","マハンマオン"], skill4:["モータルジハード","ジオダイン","メディアラハン","ラクカオート","氷結無効"], skill5:["","ジュ","メガトンプレス","氷結耐性","イービルアイ"],elements:["","無","弱","","","反","弱"], type:"支援"            },
            {                name:'スレイプニル',     name_tw:'八腳天馬',           rarity:4,                grade:62, icon:'seijyuu_sureipuniru.png', skills:["破魔ブースタ","マハンマオン","スピードスター"], skill4:["サマリカーム","ハマダイン","ディアラハン","三段の猛速","破魔無効"], skill5:["","ファイアブレ","暴飲暴食","ツイスター","マハシバブオン"],elements:["","弱","","","","耐",""],type:"攻擊"            },
            {                name:'ビャッコ',         name_tw:'白虎',       rarity:3,                grade:48, icon:'seijyuu_byako.png', skills:["スクンダ","ジオンガ","電撃ブースタ"], skill4:["狂乱の剛爪","マハジオンガ","コンセントレイト","威圧の構え","物理耐性"], skill5:["","乱れ狂い","マハブフ","精神漏出","毒床歩き"],elements:["","","","無","弱","",""],type:"攻擊"            },
            {                name:'アピス',           name_tw:'阿庇斯',     rarity:3,                grade:44, icon:'seijyuu_apisu.png', skills:["タルカジャ","マハンマ","マカラカシフト"], skill4:["メディラ","捨て身の一撃","ディスコード","三分の活泉","呪殺耐性"], skill5:["","アギ","ポイズマオン","メディア","クロズディ"],elements:["","","","","","耐","弱"],type:"支援"            },
            {                name:'ユニコーン',       name_tw:'獨角獸',         rarity:3,                grade:42, icon:'seijyuu_unicon.png', skills:["メチャームディ","魅了無効","マハザン"], skill4:["ブフダイン","絶対零度","メクロズディ","虐殺者","氷結耐性"], skill5:["","アギ","初段の賢魔","カースディ","なぎ払い"],elements:["","","","弱","","無","無"],type:"回復"            },
            {                name:'へケト',           name_tw:'海奎特',     rarity:2,                grade:27, icon:'seijyuu_heketo.png', skills:["メディア","マハジオ","メポズムディ"], skill4:["ジオンガ","放電","デクンダ","二分の活泉","火炎耐性"], skill5:["","メチャームディ","なぎ払い","見切り","百発百中"],elements:["","","","耐","弱","",""],type:"回復"            }
        ]
    },
    {
        name:'幻魔',
        formulas:[
            ['魔神','女神'],
            ['地母神','神獸'],
            ['地母神','破壞神'],
            ['妖魔','魔神'],
            ['妖魔','地母神'],
            ['墮天使','妖魔'],
            ['邪神','地母神'],
            ['邪神','鬼神'],
            ['妖獸','鬼神'],
            //['妖獸','妖魔'],    //180419 remove
            ['外道','神獸'],
            ['外道','墮天使'],
            ['魔王','神獸'],
            ['魔王','地母神'],
            ['幽鬼','魔神']
        ],
        devils:[
            {                name:'クー・フーリン',    name_tw:'庫夫林',            rarity:5,                grade:81, icon:'genma_kuhurin.png', skills:["ミナゴロシの愉悦","マハザンダイン","ゲイボルグ"], skill4:["リベリオン","殺風激","リカームドラ","衝撃貫通","呪殺反射"], skill5:["","メギドラ","マカジャマ","デスバウンド","アイスエイジ"],elements:["耐","","","","無","",""],type:"攻擊"            },
            {                name:'ツクヨミ',          name_tw:'月讀',      rarity:4,                grade:67, icon:'genma_tukuyomi.png', skills:["一分の魔脈","ザンマ","月の加護"], skill4:["マハザン","ムドオン","リカーム","二分の活泉","火炎吸収"], skill5:["","スクカジャ","自然治癒","ハマオン","ジオンガ"],elements:["弱","無","無","耐","耐","",""], type:"支援"            },
            {                name:'ハヌマーン',        name_tw:'哈奴曼',        rarity:4,                grade:60, icon:'genma_hanuman.png', skills:["物理耐性","空間殺法","マハザンマ"], skill4:["狂乱の剛爪","ザンダイン","挑発","猛反撃","衝撃反射"], skill5:["","初段の恵体","イービルアイ","審判の光","虚弱耐性"],elements:["","","","弱","無","",""],type:"攻擊"            },
            {                name:'クルースニク',      name_tw:'克雷斯尼克',          rarity:3,                grade:49, icon:'genma_kurusuniku.png', skills:["スクンダ","電撃無効","審判の光"], skill4:["勝利のチャクラ","五月雨斬","リベリオ","無慈悲な一撃","呪殺無効"], skill5:["","初段の恵体","マハムド","猛反撃","百発百中"],elements:["","","","","弱","無",""],type:"攻擊"            },
            {                name:'タム・リン',        name_tw:'塔姆林',        rarity:3,                grade:40, icon:'genma_tamurin.png', skills:["自然治癒","ウィンドブレス","暗夜剣"], skill4:["ハマダイン","デスバウンド","メディラ","テトラカシフト","火炎耐性"], skill5:["","マハザン","マハラギ","突撃","スラッシュ"],elements:["","","","","","耐","弱"],type:"攻擊"            },
            {                name:'クラマテング',      name_tw:'鞍馬天狗',          rarity:2,                grade:27, icon:'genma_muramatengu.png', skills:["スクカジャ","ハマ","マハザン"], skill4:["マハンマ","ザンマ","スクンダ","毒床渡り","火炎耐性"], skill5:["","メディア","マハブフ","パララディ","メチャームディ"],elements:["","","","弱","無","",""], type:"攻擊"           }
        ]
    },
    {
        name:'破壞神',
        formulas:[
            ['地母神','女神'],
            ['地母神','靈鳥'],    //180419 add
            ['鬼神','大天使'],
            ['鬼神','魔神'],
            ['天使','魔神'],
            ['天使','地母神'],
            ['龍王','魔神'],
            ['墮天使','魔神'],
            ['妖鬼','地母神'],
            ['邪神','女神'],
            ['魔王','魔神'],
            ['魔王','墮天使'],
            ['幽鬼','女神']
        ],
        devils:[
            {                name:'シヴァ',           name_tw:'濕婆',     rarity:5,                grade:93, icon:'hakaisin_siva.png' , skills:["虐殺者","空間殺法","プララヤ"], skill4:["魅了無効","ゴッドハンド","リベリオン","寸分の見切り","氷結吸収"], skill5:["","デゾレトオン","アイスブレス","ブフーラ","マハポイズマ"],elements:["耐","吸","弱","吸","","",""],type:"攻擊"           },
            {                name:'スサノオ',         name_tw:'素盞嗚尊',       rarity:5,                grade:82, icon:'hakaisin_susanoo.png', skills:["暗殺者","モータルジハード","天叢雲剣"], skill4:["三段の剛力","殺風激","チャージ","無慈悲な一撃","電撃吸収"], skill5:["","ディアラハン","地獄の業火","フォッグブレス","ハマダイン"],elements:["耐","弱","","","吸","",""],type:"攻擊"            },
            {                name:'ホクトセイクン',    name_tw:'北斗星君',            rarity:4,                grade:69, icon:'hakaisin_hokutoseikun.png', skills:["氷結ブースタ","ブフダイン","絶対零度"], skill4:["リカーム","マハブフダイン","バリア","呪い無効","氷結反射"], skill5:["","破魔耐性","マハザン","ブフ","乱れ狂い"],elements:["","弱","無","","","耐",""],type:"攻擊"            },
            {                name:'セイテンタイセイ',  name_tw:'齊天大聖',              rarity:4,                grade:61, icon:'hakaisin_seitentaisei.png', skills:["物理ブースタ","挑発","鬼神楽"], skill4:["チャージ","ティタノマキア","アウトブレイク","三段の恵体","物理無効"], skill5:["","裁きの雷火","ヘルズアイ","マハラギ","毒追撃"],elements:["耐","耐","","弱","耐","耐","弱"],type:"攻擊"            },
            {                name:'アレス',           name_tw:'阿瑞斯',     rarity:3,                grade:44, icon:'hakaisin_aresu.png', skills:["金剛発破","反撃","地獄の業火"], skill4:["デクンダ","怪力乱神","チャージ","コロシの愉悦","物理耐性"], skill5:["","地獄のマスク","セクシーダンス","シバブオン","暴れまくり"],elements:["","","","","","耐","弱"],type:"攻擊"            }
        ]
    },
    {
        name:'地母神',
        formulas:[
            ['聖獸','靈鳥'],      //180419 add
            ['破壞神','幻魔'],
            ['鬼神','女神'],
            ['鬼神','靈鳥'],      //180419 add
            ['鬼神','聖獸'],
            ['鬼神','破壞神'],
            ['墮天使','大天使'],
            ['妖鬼','破壞神'],
            ['鬼女','魔神'],
            //['鬼女','聖獸'],      //180419 remove
            ['鬼女','破壞神'],
            ['鬼女','鬼神'],
            //['邪神','夜魔'],      //180419 remove
            ['魔王','鬼女'],
            ['魔王','夜魔']
        ],
        devils:[
            {   name:'アシェラト',    name_tw:'亞舍拉',  rarity:5,        grade:83, icon:'tibosin_asyerato.png', skills:["メディラマ","サマリカーム","マハラギオン"], skill4:["混沌の海","トリスアギオン","静寂の祈り","回復ハイブースタ","氷結反射"], skill5:["","審判の光","地獄のマスク","二段の強運","緊縛追撃"],elements:["","無","弱","","無","","弱"], type:"回復"            },
            {   name:'スカディ',      name_tw:'絲卡蒂',  rarity:4,        grade:67, icon:'tibosin_sukadei.png', skills:["マハマカジャマ","魔封追撃","マハムドオン"], skill4:["二段の強運","絶対零度","マカラコワース","狂い咲き","火炎耐性"], skill5:["","放電","二段の剛力","メディラ","電撃耐性"],elements:["","弱","吸","","","",""], type:"支援"             },
            {                name:'キクリヒメ',     name_tw:'菊理媛',           rarity:4,                grade:60, icon:'tibosin_kikurihime.png', skills:["リディア","マハラギオン","マリンカリオン"], skill4:["二段の恵体","アギダイン","ディアラマ","テトラカシフト","呪殺耐性"],skill5:["","火炎耐性","マハポイズマオン","捨て身の一撃","ラクカジャ"], elements:["","","","弱","無","","弱"], type:"回復"            },
            {                name:'イシス',        name_tw:'伊西斯',        rarity:3,                grade:54, icon:'tibosin_isisu.png', skills:["サマリカーム","ザンダイン","マハマカジャマ"], skill4:["二分の魔脈","マハザン","メウィークディ","追い打","衝撃無効"], skill5:["","初段の剛力","百発百中","メチャームディ","ザン"],elements:["","耐","","無","","",""], type:"支援"            },
            {                name:'クシナビヒメ',   name_tw:'奇稻田姬',             rarity:3,                grade:47, icon:'tibosin_kusinabihime.png', skills:["ディアラ","回復ブースタ","マハンマ"], skill4:["メディア","ハマオン","リディア","自然治癒","破魔無効"], skill5:["","ムド","マハラギ","メパララディ","ジオ"],elements:["","","","","","耐","弱"], type:"回復"            },
            {                name:'ペレ',          name_tw:'佩蕾',      rarity:3,                grade:40, icon:'tibosin_pere.png', skills:["メポズムディ","アギラオ","毒無効"], skill4:["ディアラ","マハラギオン","リカーム","二段の強運","物理耐性"], skill5:["","メウィークディ","マハザン","毒床歩き","初段の賢魔"],elements:["","耐","弱","","","",""], type:"回復"            }
        ]
    },
    {
        name:'鬼神',
        formulas:[
            ['幻魔','神獸'],
            ['破壞神','聖獸'],
            ['破壞神','靈鳥'],     //180419 add
            //['妖魔','女神'],        //180419 remove
            ['龍王','靈鳥'],      //180419 add
            ['龍王','聖獸'],
            ['妖鬼','靈鳥'],      //180419 add
            ['妖鬼','魔神'],
            ['妖鬼','神獸'],
            ['鬼女','龍王'],
            ['夜魔','地母神'],
            //['夜魔','妖鬼'],        //180419 remove
            ['邪神','龍王'],
            ['外道','魔神'],
            ['魔王','龍王']
        ],
        devils:[
            {                name:'トール',          name_tw:'索爾',      rarity:5,                grade:83, icon:'kisin_toru.png', skills:["メガトンレイド","チャージ","ミョルニル"], skill4:["マハジオダイン","ギガントマキア","リベリオン","電撃貫通","火炎反射"], skill5:["","マハンマダイン","マハマリカリオン","イービルアイ","マハマリンカリン"],elements:["耐","無","","吸","弱","耐",""], type:"攻擊"            },
            {                name:'ショウキ',        name_tw:'鍾馗',        rarity:4,                grade:75, icon:'kisin_syouki.png', skills:["地獄のマスク","タルカオート","鬼神楽"], skill4:["魔封無効","メガトンレイド","デゾレトオン","威圧の構え","物理耐性"], skill5:["","マハムドダイン","毒床渡り","魔封追撃","マハンマオン"],elements:["","耐","","","弱","耐",""], type:"攻擊"            },
            {                name:'ビシャモンテン',   name_tw:'毘沙門天',            rarity:4,                grade:70, icon:'kisin_bisyamonten.png', skills:["破魔耐性","ブフダイン","怪力乱神"], skill4:["タルカジャ","冥界破","ディスコード","追い打ち","呪殺耐性"], skill5:["","エナジードレイン","マカジャマオン","メチャームディ","衝撃耐性"],elements:["","弱","無","","","",""], type:"攻擊"            },
            {                name:'ジコクテン',       name_tw:'持國天',         rarity:4,                grade:62, icon:'kisin_jikokuten.png', skills:["マハザンマ","冥界破","食いしばり"], skill4:["ザンダイン","メガトンレイド","マハシバブオン","三分の活泉","火炎無効"], skill5:["","バインドクロー","メディアラハン","ホワイトノイズ","吸血"],elements:["","","","弱","無","耐",""], type:"攻擊"            },
            {                name:'コウモクテン',     name_tw:'廣目天',           rarity:3,                grade:50, icon:'kisin_koumokuten.png', skills:["ジオンガ","テトラコワース","冥界破"], skill4:["メガトンプレス","ジオダイン","スクカジャ","反撃","物理耐性"], skill5:["","初段の強運","マハブフ","コロシの愉悦","ブフ"],elements:["","","","無","弱","耐",""], type:"攻擊"            },
            {                name:'ゾウチョウテン',   name_tw:'增長天',             rarity:3,                grade:41, icon:'kisin_zoutyouten.png', skills:["ラクカジャ","金剛発破","アギラオ"], skill4:["チャージ","ファイアブレス","挑発","毒床無効","呪殺耐性"], skill5:["","地獄のマスク","初段の剛力","メチャームディ","メチャームディ"],elements:["","無","弱","","","耐",""], type:"攻擊"            },
            {                name:'タケミナカタ',     name_tw:'建御名方',           rarity:2,                grade:27, icon:'kisin_takeminakata.png', skills:["反撃","ジオンガ","鬼神楽"], skill4:["電撃ブースタ","放電","メパララディ","一分の魔脈","呪殺耐性"], skill5:["","ザン","百発百中","突撃","マハブフ"],elements:["","弱","","耐","","",""], type:"攻擊"            }
        ]
    },
    {
        name:'天使',
        formulas:[
            ['幻魔','女神'],
            ['妖魔','聖獸'],
            ['妖精','神獸'],
            ['墮天使','神獸'],
            ['墮天使','妖精'],
            ['鬼女','妖鬼'],
            ['夜魔','妖精'],
            ['夜魔','鬼女'],
            ['外道','大天使'],
            ['外道','龍王'],
            ['幽鬼','神獸'],
            ['幽鬼','聖獸']
        ],
        devils:[
            {                name:'ソロネ',         name_tw:'座天使',       rarity:4,                grade:60, icon:'tensi_sorone.png', skills:["電撃耐性","マハラギオン","ダークゾーン無効"], skill4:["メディラ","マハンマオン","ディアラハン","寸分の見切り","氷結無効"], skill5:["","雄叫び","氷結耐性","デスタッチ","野生の勘"],elements:["","無","弱","","","無","弱"], type:"攻擊"            },
            {                name:'ドミニオン',     name_tw:'主天使',           rarity:3,                grade:53, icon:'tensi_dominion.png', skills:["メカースディ","呪い無効","マハジオンガ"], skill4:["メギド","ジオダイン","常世の祈り","魔封無効","電撃無効"], skill5:["","メチャームディ","スラッシュ","初段の恵体","ブフ"],elements:["","","","耐","弱","無","弱"], type:"回復"            },
            {                name:'ヴァーチャー',    name_tw:'力天使',            rarity:3,                grade:47, icon:'tensi_vatya.png', skills:["メクロズディ","魔封無効","ハマオン"], skill4:["バリア","審判の光","コンセントレイト","スクカオート","氷結無効"], skill5:["","マハジオ","アギ","初段の強運","初段の猛速"],elements:["","","","弱","無","無","弱"], type:"回復"            },
            {                name:'パワー',          name_tw:'能天使',      rarity:3,                grade:40, icon:'tensi_pawa.png', skills:["メディア","メギド","絶命剣"], skill4:["ディアラ","マハジオンガ","リベリオン","暗殺者","衝撃耐性"], skill5:["","メパララディ","ムド","初段の賢魔","自然治癒"],elements:["","","","耐","弱","無","弱"], type:"攻擊"            },
            {                name:'プリンシパリティ',   name_tw:'權天使',             rarity:2,                grade:35, icon:'tensi_purinsiparitei.png', skills:["リカーム","ハマオン","ブフ"], skill4:["メディア","審判の光","カースディ","破魔ブースタ","呪殺耐性"], skill5:["","初段の賢魔","メウィークディ","毒床歩き","マハザン"], elements:["","","","","","無","弱"], type:"回復"            },
            {                name:'アークエンジェル',   name_tw:'大天使',             rarity:2,                grade:25, icon:'tensi_akuenjyeru.png', skills:["タルカジャ","アギ","ハマ"], skill4:["ヒートウェイブ","アギラオ","リディアコワース","百発百中","物理耐性"], skill5:["","ザン","初段の賢魔","ブフ","百発百中"],elements:["","","","","","無","弱"], type:"攻擊"            },
            {                name:'エンジェル',         name_tw:'天使',       rarity:2,                grade:20, icon:'tensi_enjyeru.png', skills:["ハマ","マハンマ","ディアラ"], skill4:["ラクカジャ","審判の光","チャームディ","魔封無効","電撃耐性"], skill5:["","クロズディ","アギ","メチャームディ","マハブフ"],elements:["","","","弱","","無","弱"], type:"回復"            }
        ]
    },
    {
        name:'妖魔',
        formulas:[
            ['幻魔','聖獸'],
            ['鬼神','幻魔'],
            //['妖精','龍王'],        //180419 remove
            ['墮天使','幻魔'],
            ['妖鬼','天使'],
            ['邪神','靈鳥'],      //180419 add
            ['邪神','聖獸'],
            ['妖獸','幻魔'],
            ['外道','夜魔'],
            ['外道','破壞神'],
            ['魔王','幻魔'],
            ['幽鬼','天使']
        ],
        devils:[
            {                name:'ガネーシャ',     name_tw:'象頭神',           rarity:4,                grade:66, icon:'youma_ganesya.png', skills:["怪力乱神","チャージ","ラクカジャ"], skill4:["捨て身の一撃","メガトンレイド","挑発","物理ブースタ","呪殺無効"], skill5:["","メポズムディ","マハザンダイン","天罰","デゾレト"],elements:["耐","","","弱","無","","弱"], type:"攻擊"            },
            {                name:'イフリート',     name_tw:'伊弗利特',           rarity:3,                grade:52, icon:'youma_ihurito.png', skills:["アギラオ","火炎ブースタ","マハラギ"], skill4:["アギダイン","地獄の業火","メクロズディ","追い打ち","電撃耐性"], skill5:["","なぎ払い","ヒートウェイブ","ザン","アウトブレイク"],elements:["","吸","弱","","","",""], type:"攻擊"            },
            {                name:'ヴァルキリー',   name_tw:'女武神',             rarity:3,                grade:40, icon:'youma_varukiri.png' , skills:["マハンマ","絶命剣","物理ブースタ"], skill4:["ヒートウェイブ","デスバウンド","テトラコワース","三分の活泉","電撃耐性"], skill5:["","メウィークディ","スラッシュ","クロズディ","ウィークディ"],elements:["耐","","","弱","耐","",""], type:"攻擊"           },
            {                name:'ディース',       name_tw:'迪絲',         rarity:2,                grade:34, icon:'youma_deisu.png', skills:["マカジャマ","アギラオ","ザン"], skill4:["メディラ","メギド","バリアコワース","魔封追撃","衝撃耐性"], skill5:["","チャームディ","初段の賢魔","初段の恵体","マハムド"],elements:["","","耐","耐","","","弱"], type:"回復"            },
            {                name:'アプサラス',     name_tw:'飛天女神',           rarity:1,                grade:11, icon:'youma_apusarasu.png', skills:["ポズムディ","ブフ",""], skill4:["ディアラ","ブフーラ","メチャームディ","初段の猛速","電撃耐性"], skill5:["","メポズムディ","マハブフ","野生の勘","見切り"],elements:["","弱","耐","","","",""], type:"回復"            },
            {                name:'コッパテング',   name_tw:'木葉天狗',             rarity:1,                grade:7, icon:'youma_kopatengu.png', skills:["毒床歩き","ザン",""], skill4:["ウィンドブレス","ザンマ","タルンダ","野生の勘","火炎耐性"], skill5:["","チャームディ","メクロズディ","マハジオ","パララディ"],elements:["","","","弱","耐","",""], type:"攻擊"            },
            {                name:'アガシオン',     name_tw:'阿珈席翁',          rarity:1,                grade:5, icon:'youma_agasion.png', skills:["カースディ","ジオ",""], skill4:["マハジオ","ヒートウェイブ","クロズディ","初段の強運","呪殺耐性"], skill5:["","マハラギ","メクロズディ","ザン","初段の強運"],elements:["","耐","弱","耐","","","弱"], type:"攻擊"            }
        ]
    },
    {
        name:'龍王',
        formulas:[
            ['天使','靈鳥'],      //180419 add
            //['天使','神獸'],        //180419 remove
            ['妖魔','幻魔'],
            //['魔獸','神獸'],        //180419 remove
            ['妖精','聖獸'],
            ['妖精','幻魔'],
            ['墮天使','靈鳥'],    //180419 add
            ['妖鬼','墮天使'],
            ['夜魔','天使'],
            ['外道','幻魔'],
            ['外道','妖魔'],
            ['魔王','破壞神'],
            ['魔王','外道'],
            ['幽鬼','鬼神']
        ],
        devils:[
            {                name:'アナンタ',      name_tw:'阿南塔',          rarity:5,                grade:83, icon:'ryuuou_ananta.png' , skills:["ディアラハン","スクカオート","ラクカオート"], skill4:["天罰","マハブフダイン","マハポイズマオン","タルカオート","氷結吸収"], skill5:["","ギガントマキア","マハザンダイン","モータルジハード","鬼神楽"],elements:["","","無","無","弱","無",""], type:'支援'           },
            {                name:'ユルング',      name_tw:'虹蛇',          rarity:4,                grade:70, icon:'ryuuou_yurungu.png', skills:["マハシバブー","サマリカーム","マハブフーラ"], skill4:["三段の強運","ブフダイン","ディアラマ","毒無効","火炎耐性"], skill5:["","溶解ブレス","リカームドラ","毒追撃","マハンマ"], elements:["","弱","無","耐","","","弱"], type:'支援'            },
            {                name:'ヤマタノオロチ',    name_tw:'八岐大蛇',            rarity:4,                grade:61, icon:'ryuuou_yamatanooroti.png', skills:["ブフダイン","メガトンプレス","毒床無効"], skill4:["バリア","アギダイン","リカームドラ","タルカオート","破魔無効"], skill5:["","毒床歩き","デカジャ","吸魔","ミナゴロシの愉悦"],elements:["","無","無","弱","","",""], type:"攻擊"            },
            {                name:'ゲンブ',        name_tw:'玄武',        rarity:3,                grade:45, icon:'ryuuou_genbu.png', skills:["ブフーラ","マハブフーラ","氷結ブースタ"], skill4:["ラクカジャ","ブフダイン","マカラコワース","勝利の息吹","物理耐性"], skill5:["","毒床歩き","初段の剛力","スラッシュ","乱れ狂い"],elements:["","弱","無","","","",""], type:'攻擊'            },
            {                name:'ナーガ',        name_tw:'那迦',        rarity:2,                grade:28, icon:'ryuuou_naga.png', skills:["絶命剣","ブフーラ","百発百中"], skill4:["リベリオン","デスバウンド","デゾレト","二分の活泉","氷結無効"], skill5:["","突撃","見切り","メポズムディ","ヒートウェイブ"],elements:["","弱","耐","耐","弱","","弱"], type:"攻擊"            },
            {                name:'ノズチ',        name_tw:'野槌',        rarity:1,                grade:15, icon:'ryuuou_nozuti.png', skills:["一分の活泉","マハジオ",""], skill4:["暴れまくり","ジオンガ","カースディ","百発百中","火炎耐性"], skill5:["","マハザン","メチャームディ","なぎ払い","パララディ"],elements:["耐","弱","耐","耐","弱","","弱"],type:"攻擊"            }
        ]
    },
    {
        name:'魔獸',
        formulas:[
            ['龍王','大天使'],
            ['龍王','神獸'],
            ['墮天使','鬼神'],
            ['墮天使','龍王'],
            ['妖鬼','幻魔'],
            ['妖鬼','龍王'],
            ['妖獸','神獸'],
            ['妖獸','夜魔'],
            ['外道','妖獸'],
            ['魔王','聖獸'],
            ['幽鬼','靈鳥'],      //180419 add
            ['幽鬼','破壞神'],
            ['幽鬼','魔王']
        ],
        devils:[
            {                name:'ケルベロス',     name_tw:'地獄犬',           rarity:4,                grade:61, icon:'majyuu_keruberosu.png', skills:["アギダイン","地獄の獰爪","雄叫び"], skill4:["二分の活泉","ファイアブレス","マハデゾレトオン","追い打ち","物理耐性"], skill5:["","緊縛追撃","反撃","ヒートウェイブ","初段の猛速"],elements:["","反","弱","","","",""], type:'攻擊'            },
            {                name:'アーマーン',     name_tw:'阿米特',           rarity:3,                grade:44, icon:'majyuu_aman.png', skills:["リベリオン","デスタッチ","狂乱の剛爪"], skill4:["二段の猛速","暴飲暴食","雄叫び","魅了無効","氷結耐性"], skill5:["","ジオ","暴れまくり","初段の恵体","マハブフ"],elements:["","","弱","無","","",""], type:'攻擊'            },
            {                name:'オルトロス',     name_tw:'雙頭犬',           rarity:2,                grade:35, icon:'majyuu_orutorosu.png', skills:["アギラオ","丸かじり","マハラギ"], skill4:["金剛発破","ファイアブレス","リカーム","緊縛耐性","電撃耐性"], skill5:["","メクロズディ","ウィークディ","初段の剛力","ヒートウェイブ"],elements:["","無","弱","","","","耐"], type:'攻擊'            },
            {                name:'ネコマタ',       name_tw:'貓怪',         rarity:1,                grade:14, icon:'majyuu_nekomata.png', skills:["チャームディ","マハザン",""], skill4:["スクカジャ","ザンマ","アムリタ","魅了耐性","氷結耐性"], skill5:["","マハブフ","乱れ狂い","暴れまくり","マハンマ"],elements:["","耐","弱","弱","耐","",""], type:'支援'            },
            {                name:'イヌガミ',       name_tw:'犬神',         rarity:1,                grade:9, icon:'majyuu_inugami.png', skills:["アギ","パララディ",""], skill4:["マハラギ","アギラオ","ラクンダ","緊縛耐性","呪殺耐性"], skill5:["","地獄のマスク","初段の賢魔","メパララディ","ムド"],elements:["","耐","	弱","","","",""], type:'支援'            },
            {                name:'カーシー',       name_tw:'犬妖',         rarity:1,                grade:3, icon:'majyuu_kasi.png', skills:["スラッシュ","アギ",""], skill4:["アムリタ","甘噛み","タルカジャ","一分の活泉","火炎耐性"], skill5:["","ポズムディ","地獄のマスク","初段の猛速","ディア"],elements:["","","","","","無",""], type:'支援'            }
        ]
    },
    {
        name:'妖精',
        formulas:[
            ['妖魔','神獸'],
            ['妖魔','天使'],
            ['龍王','女神'],
            ['龍王','天使'],
            ['魔獸','幻魔'],
            ['鬼女','女神'],
            ['夜魔','聖獸'],
            ['夜魔','龍王'],
            ['夜魔','魔獸'],
            ['妖獸','天使'],
            ['妖獸','妖鬼'],
            ['外道','鬼神'],
            ['魔王','靈鳥']      //180419 add
        ],
        devils:[
            {                name:'オベロン',        name_tw:'奧伯隆',        rarity:4,                grade:67, icon:'yousei_oberon.png', skills:["衝撃ブースタ","ザンダイン","マハマリカリオン"], skill4:["マカラカーン","ツイスター","メチャームディ","スクカオート","氷結耐性"], skill5:["","スラッシュ","初段の恵体","タルカジャ","吸魔"],elements:["","","","弱","吸","",""], type:"攻擊"            },
            {                name:'ティターニア',    name_tw:'提泰妮婭',            rarity:4,                grade:62, icon:'yousei_teitania.png', skills:["電撃ブースタ","マハジオンガ","マカジャマオン"], skill4:["二分の魔脈","ショックウェーブ","デゾレトオン","追い打ち","物理耐性"], skill5:["","タルンダ","マハムド","絶命剣","放電"],elements:["","","","","","耐","耐"], type:"支援"            },
            {                name:'セタンタ',        name_tw:'瑟坦特',        rarity:3,                grade:47, icon:'yousei_setanta.png', skills:["鬼神楽","千発千中","金剛発破"], skill4:["デスバウンド","ザンマ","タルカジャ","狂戦士","電撃耐性"], skill5:["","初段の恵体","ジオ","カースディ","ヒートウェイブ"],elements:["","","","弱","無","","弱"], type:"攻擊"           },
            {                name:'シルキー',        name_tw:'希路奇',        rarity:3,                grade:42, icon:'yousei_siruki.png', skills:["メウィークディ","虚弱無効","ブフダイン"], skill4:["メディラ","マハブフーラ","リディア","奈落のマスク","衝撃無効"], skill5:["","コロシの愉悦","なぎ払い","毒床歩き","野生の勘"],elements:["","弱","無","","","",""], type:"支援"            },
            {                name:'ケルピー',        name_tw:'凱爾皮',        rarity:2,                grade:35, icon:'yousei_kerupi.png', skills:["ディアラ","ジオンガ","暴れまくり"], skill4:["ダークゾーン無効","吸魔","リディア","野生の勘","呪殺耐性"], skill5:["","百発百中","マハジオ","百発百中","ジオ"],elements:["","","耐","","弱","",""], type:"回復"            },
            {                name:'ハイピクシー',      name_tw:'高等皮克希',          rarity:2,                grade:24, icon:'yousei_hiipikusi.png', skills:["デゾレト","メディア","マハジオ"], skill4:["リディア","放電","ディアラ","乱れ狂い","破魔耐性"], skill5:["","初段の賢魔","ムド","アギ","初段の剛力"],elements:["","","","","耐","",""], type:"回復"            },
            {                name:'ジャックランタン',  name_tw:'燈籠傑克',              rarity:1,                grade:13, icon:'yousei_jyakurantan.png', skills:["アギ","マハラギ",""], skill4:["アギラオ","ファイアブレス","バトンタッチ","一分の魔脈","衝撃耐性"], skill5:["","マハンマ","クロズディ","初段の賢魔","自然治癒"],elements:["","耐","弱","","","",""], type:"攻擊"            },
            {                name:'ジャックフロスト',  name_tw:'冰霜傑克',              rarity:1,                grade:7, icon:'yousei_jyakufurosuto.png', skills:["ブフ","マハブフ",""], skill4:["ハマ","ブフーラ","バトンタッチ","反撃","電撃耐性"], skill5:["","メカースディ","自然治癒","見切り","パララディ"],elements:["","弱","耐","","","",""], type:"攻擊"            },
            {                name:'ピクシー',         name_tw:'皮克希',       rarity:1,                grade:2, icon:'yousei_pikusi.png' , skills:["ザン","ディア",""], skill4:["回復ブースタ","マハジオ","メディア","魔封耐性","破魔耐性"], skill5:["","初段の賢魔","メカースディ","メチャームディ","地獄のマスク"],elements:["","","","耐","","","弱"], type:"回復"           }
        ]
    },
    {
        name:'墮天使',
        formulas:[
            ['魔神','大天使'],
            ['魔獸','天使'],
            ['魔獸','妖魔'],
            ['妖鬼','魔獸'],
            ['夜魔','大天使'],
            ['夜魔','女神'],
            ['邪神','幻魔'],
            ['邪神','天使'],
            ['妖獸','鬼女'],
            ['外道','女神'],
            ['外道','天使'],
            ['幽鬼','大天使']
        ],
        devils:[
            {                name:'サマエル',       name_tw:'薩麥爾',         rarity:5,                grade:84, icon:'datensi_samaeru.png', skills:["勝利のチャクラ","メシアライザー","エナジードレイン"], skill4:["デスカウンター","煉獄","テトラカーン","無限のチャクラ","火炎無効"], skill5:["","ファイアブレス","アギラオ","丸かじり","回復ブースタ"],elements:["","","","弱","","反","反"], type:'支援'            },
            {                name:'ダンタリアン',   name_tw:'但他林',             rarity:4,                grade:70, icon:'datensi_dantarian.png', skills:["マカラカーン","フォッグブレス","ハマダイン"], skill4:["二分の魔脈","暴飲暴食","バインドボイス","マカラカシフト","呪殺反射"], skill5:["","バインドボイス","アイスブレス","挑発","二段の強運"],elements:["","耐","耐","弱","無","弱","耐"], type:'支援'            },
            {                name:'オセ',          name_tw:'歐賽',      rarity:3,                grade:54, icon:'datensi_ose.png', skills:["冥界破","マハジオンガ","チャージ"], skill4:["猛反撃","メガトンプレス","テトラカーン","二段の剛力","物理無効"], skill5:["","アギ","チャームディ","メディア","乱れ狂い"],elements:["","","","","","","耐"], type:'攻擊'            },
            {                name:'フォルネウス',   name_tw:'佛鈕司',             rarity:3,                grade:41, icon:'datensi_huoruneosu.png', skills:["ブフーラ","マハジオ","フォッグブレス"], skill4:["電撃耐性","マハブフーラ","マハシバブー","氷結ブースタ","破魔無効"], skill5:["","初段の猛速","メクロズディ","ジオ","チャームディ"],elements:["","","吸","弱","","","無"], type:'支援'            },
            {                name:'デカラビア',     name_tw:'丹卡拉比',           rarity:2,                grade:23, icon:'datensi_dekarabia.png', skills:["マハラギ","マハブフ","ブフ"], skill4:["マリンカリン","アギラオ","メクロズディ","魔封耐性","氷結耐性"], skill5:["","ディア","マハジオ","ポズムディ","パララディ"],elements:["","","","","","	弱","耐"], type:'攻擊'            },
            {                name:'エリゴール',     name_tw:'埃力格',           rarity:1,                grade:10, icon:'datensi_erigoru.png', skills:["ムド","なぎ払い",""], skill4:["食いしばり","絶命剣","ラクカジャ","反撃","破魔耐性"], skill5:["","ディア","初段の賢魔","チャームディ","チャームディ"],elements:["耐","","","弱","","","無"], type:'攻擊'            },
            {                name:'メルコム',       name_tw:'梅爾克',         rarity:1,                grade:4, icon:'datensi_merukomu.png', skills:["ディア","アギ",""], skill4:["ファイアブレス","マハラギ","カースディ","一分の魔脈","物理耐性"], skill5:["","毒床歩き","コロシの愉悦","スラッシュ","ムド"],elements:["","耐","弱","","弱","弱","耐"], type:'回復'            }
        ]
    },
    {
        name:'妖鬼',
        formulas:[
            ['妖魔','大天使'],
            ['魔獸','龍王'],
            ['妖精','破壞神'],
            ['妖精','鬼神'],
            ['鬼女','靈鳥'],      //180419 add
            ['鬼女','妖魔'],
            ['邪神','妖精'],
            ['邪神','墮天使'],
            ['邪神','鬼女'],
            ['妖獸','聖獸'],
            ['幽鬼','龍王'],
            ['幽鬼','墮天使'],
            ['幽鬼','外道']
        ],
        devils:[
            {                name:'オンギョウキ',     name_tw:'隱形鬼',           rarity:4,                grade:68, icon:'youki_ongyouki.png', skills:["暗夜剣","ラクカオート","マハブフーラ"], skill4:["デスタッチ","虚空爪激","アウトブレイク","デスカウンター","呪殺無効"], skill5:["","反撃","魅了追撃","初段の強運","ウィンドブレス"],elements:["耐","","耐","","耐","弱",""], type:"攻擊"            },
            {                name:'ベルセルク',       name_tw:'狂戰士',         rarity:3,                grade:54, icon:'youki_beruseruku.png', skills:["チャージ","暗夜剣","マハブフ"], skill4:["不屈の闘志","メガトンプレス","リベリオン","猛反撃","氷結無効"], skill5:["","ソウルドレイン","初段の賢魔","クロズディ","野生の勘"],elements:["無","","","","弱","",""], type:"攻擊"            },
            {                name:'シキオウジ',       name_tw:'式王子',         rarity:3,                grade:49, icon:'youki_sikiouji.png', skills:["魔封耐性","ハマ","ムド"], skill4:["デカジャ","メギド","ラクンダ","追い打ち","氷結耐性"], skill5:["","メウィークディ","マハラギ","祟り","ディア"],elements:["無","弱","弱","","","耐","耐"], type:"攻擊"            },
            {                name:'ヨモツイクサ',     name_tw:'黃泉軍',           rarity:3,                grade:41, icon:'youki_yomotuikusa.png', skills:["毒耐性","アイスブレス","マハムドオン"], skill4:["無慈悲な一撃","刹那五月雨撃ち","ジュオン","ミナゴロシの愉悦","破魔耐性"], skill5:["","クロズディ","初段の恵体","メカースディ","メウィークディ"],elements:["","","","","弱","弱","耐"], type:"攻擊"            },
            {                name:'オ二',            name_tw:'鬼',    rarity:2,                grade:27, icon:'youki_oni.png', skills:["テトラコワース","マハラギ","金剛発破"], skill4:["鬼神楽","五月雨斬り","チャージ","コロシの愉悦","衝撃耐性"],skill5:["","ヒートウェイブ","アギ","突撃","ポズムディ"], elements:["","","","弱","","",""], type:"攻擊"            },
            {                name:'モムノフ',         name_tw:'桃生',       rarity:1,                grade:15, icon:'youki_momunohu.png', skills:["なぎ払い","反撃",""], skill4:["ヒートウェイブ","鬼神楽","デクンダ","食いしばり","衝撃耐性"], skill5:["","見切り","アギ","メポズムディ","初段の恵体"],elements:["耐","","","","弱","",""], type:"攻擊"            },
            {                name:'アズミ',          name_tw:'安曇神',      rarity:1,                grade:3, icon:'youki_azumi.png', skills:["パララディ","ブフ",""], skill4:["アイスブレス","マハブフ","ディア","一分の活泉","衝撃耐性"], skill5:["","ジオ","メパララディ","マハジオ","スラッシュ"],elements:["","","耐","弱","","",""], type:"回復"            }
        ]
    },
    {
        name:'鬼女',
        formulas:[
            ['妖魔','鬼神'],
            ['龍王','地母神'],
            ['龍王','鬼神'],
            ['魔獸','靈鳥'],      //180419 add
            ['魔獸','地母神'],
            ['墮天使','女神'],
            ['妖鬼','女神'],
            ['妖鬼','聖獸'],
            ['妖鬼','妖魔'],
            ['夜魔','靈鳥'],      //180419 add
            ['夜魔','鬼神'],
            ['幽鬼','幻魔'],
            ['幽鬼','夜魔']
        ],
        devils:[
            {                name:'ランダ',          name_tw:'讓特',     rarity:4,                grade:67, icon:'kijyo_randa.png', skills:["マハジュオン","ムドダイン","マハザンダイン"], skill4:["空間殺法","煉獄","リカームドラ","食いしばり","衝撃無効"], skill5:["","ウィンドブレス","マハブフーラ","デカジャ","吸魔"],elements:["反","","","弱","","",""] , type:"攻擊"           },
            {                name:'ダーキニー',      name_tw:'荼吉尼',          rarity:3,                grade:53, icon:'kijyo_dakini.png', skills:["バリアコワース","アギラオ","怪力乱神"], skill4:["ポイズマオン","アギダイン","マハマカジャマ","毒無効","氷結耐性"], skill5:["","毒ガスブレス","ショックウェーブ","初段の賢魔","野生の勘"],elements:["耐","吸","弱","","","",""], type:"支援"            },
            {                name:'マーメイド',      name_tw:'美人魚',          rarity:3,                grade:42, icon:'kijyo_mameido.png', skills:["アイスブレス","ウィンドブレス","メディア"], skill4:["セクシーダンス","ブフダイン","メチャームディ","無限のチャクラ","氷結無効"], skill5:["","クロズディ","暴れまくり","パララディ","暴れまくり"],elements:["","","耐","弱","耐","",""] , type:"回復"           },
            {                name:'ヤクシニー',      name_tw:'夜叉女',          rarity:2,                grade:34, icon:'kijyo_yakusini.png', skills:["呪い耐性","アギラオ","マハザン"], skill4:["刹那五月雨撃ち","ジオンガ","シバブー","初段の剛力","物理耐性"], skill5:["","ハマ","毒床歩き","マハラギ","初段の猛速"],elements:["","","","弱","耐","",""], type:"攻擊"            },
            {                name:'ヨモツシコメ',    name_tw:'黃泉醜女',            rarity:2,                grade:23, icon:'kijyo_yomotusikome.png', skills:["タルンダ","毒針","ブフーラ"], skill4:["バインドクロー","デスバウンド","ウィークディ","見切り","衝撃耐性"], skill5:["","突撃","アギ","パララディ","ザン"],elements:["","弱","","","","弱","耐"] , type:"支援"           },
            {                name:'リャナンシー',    name_tw:'菈南希',            rarity:1,                grade:12, icon:'kijyo_ryanansi.png', skills:["ディア","ブフ",""], skill4:["メディア","ムドオン","リカーム","毒耐性","衝撃耐性"], skill5:["","自然治癒","ハマ","地獄のマスク","なぎ払い"],elements:["","","","","弱","",""], type:"回復"            }
        ]
    },
    {
        name:'夜魔',
        formulas:[
            ['天使','鬼神'],
            ['妖魔','靈鳥'],      //180419 add
            ['龍王','妖魔'],
            ['妖精','靈鳥'],      //180419 add
            ['妖精','魔神'],
            ['墮天使','地母神'],
            ['妖鬼','妖精'],
            ['鬼女','幻魔'],
            ['妖獸','魔神'],
            //['妖獸','龍王'],      //180419 remove
            ['妖獸','墮天使'],
            //['魔王','妖魔'],      //180419 remove
            ['魔王','妖精'],
            ['魔王','妖獸'],
            ['幽鬼','妖獸']
        ],
        devils:[
            {                name:'リリス',        name_tw:'莉莉絲',        rarity:5,                grade:80, icon:'yoma_ririsu.png', skills:["マハジオダイン","エナジードレイン","肉体の解放"], skill4:["狂い咲き","精神漏出","サマリカーム","三段の強運","破魔無効"], skill5:["","毒床渡り","タルンダ","煉獄","暗殺者"],elements:["","耐","耐","吸","弱","弱","無"], type:"支援"            },
            {                name:'サキュバス',    name_tw:'女夢魔',            rarity:4,                grade:63, icon:'yoma_sakyubasu.png', skills:["マハマリンカリン","魅了追撃","ブフダイン"], skill4:["吸魔","マハジオンガ","マハデゾレト","魅了無効","破魔耐性"], skill5:["","吸血","マハブフーラ","野獣の勘","マハムドオン"],elements:["","耐","耐","","","弱",""], type:"支援"            },
            {                name:'リリム',        name_tw:'莉莉姆',        rarity:3,                grade:47, icon:'yoma_ririmu.png', skills:["魅了耐性","マハザンマ","マリンカリン"], skill4:["吸魔","ザンダイン","メクロズディ","二段の賢魔","電撃無効"], skill5:["","初段の強運","ブフ","ウィークディ","ジオ"],elements:["","","弱","","無","",""], type:"支援"            },
            {                name:'キオン',        name_tw:'迦溫',        rarity:3,                grade:42, icon:'yoma_kiun.png', skills:["ムドオン","マハムド","呪殺ブースタ"], skill4:["スクカジャ","マハムドオン","マカラコワース","食いしばり","氷結耐性"], skill5:["","初段の賢魔","初段の強運","コロシの愉悦","マハンマ"],elements:["","","弱","","","弱","無"], type:"攻擊"            },
            {                name:'フォーモリア',   name_tw:'弗莫爾',             rarity:2,                grade:30, icon:'yoma_huomoria.png' , skills:["マハブフ","金剛発破","ハマオン"], skill4:["追い打ち","ブフーラ","リベリオン","二分の活泉","破魔耐性"], skill5:["","ムド","ザン","ブフ","マハラギ"],elements:["","弱","耐","","","",""], type:"攻擊"           },
            {                name:'インキュバス',   name_tw:'男夢魔',             rarity:2,                grade:21, icon:'yoma_inkyubasu.png', skills:["マリンカリン","ムドオン","ザン"], skill4:["吸血","マハザン","メパララディ","魅了追撃","氷結耐性"], skill5:["","マハムド","乱れ狂い","地獄のマスク","コロシの愉悦"],elements:["","","","弱","耐","",""], type:"支援"            },
            {                name:'ザントマン',     name_tw:'睡魔',           rarity:1,                grade:10, icon:'yoma_zandoman.png', skills:["ザン","スラッシュ",""], skill4:["シバブー","暗夜剣","スクンダ","超自然治癒","氷結耐性"], skill5:["","暴れまくり","ポズムディ","マハジオ","毒床歩き"],elements:["","","","弱","耐","",""], type:"攻擊"            },
            {                name:'モコイ',         name_tw:'惡靈',       rarity:1,                grade:5, icon:'yoma_mokoi.png', skills:["ジオ","突撃",""], skill4:["暴れまくり","ジオンガ","ウィークディ","初段の剛力","呪殺耐性"], skill5:["","ムド","ヒートウェイブ","毒床歩き","自然治癒"],elements:["","","","耐","弱","",""], type:"攻擊"            }
        ]
    },
    {
        name:'邪神',
        formulas:[
            ['天使','破壞神'],
            ['妖獸','魔獸'],
            ['外道','地母神'],
            ['魔王','天使'],
            ['魔王','魔獸']
        ],
        devils:[
            {                name:'セト',         name_tw:'賽特',       rarity:5,                grade:84, icon:'jyasin_seto.png', skills:["ザンダイン","ランダマイザ","モータルジハード"], skill4:["ティタノマキア","精神漏出","アウトブレイク","衝撃ハイブースタ","火炎耐性"], skill5:["","マリンカリン","マハマリンカリン","冥界破","ジュ"],elements:["","弱","","無","無","","吸"], type:'攻擊'            },
            {                name:'ギリメカラ',    name_tw:'獨眼魔象',            rarity:4,                grade:67, icon:'jyasin_girimekara.png', skills:["呪殺耐性","リベリオン","メガトンプレス"], skill4:["バインドボイス","暴飲暴食","ラクンダ","ミナゴロシの愉悦","衝撃耐性"], skill5:["","審判の光","アギダイン","クロズディ","ブフーラ"],elements:["反","","","弱","弱","弱",""], type:'攻擊'            },
            {                name:'パズス',        name_tw:'帕祖祖',        rarity:4,                grade:62, icon:'jyasin_pazusu.png', skills:["火炎耐性","メディラマ","煉獄"], skill4:["ホワイトノイズ","マハムドダイン","サマリカーム","デスカウンター","破魔無効"], skill5:["","魔封耐性","メディア","ザンマ","デスバウンド"],elements:["","","弱","","無","","無"], type:'回復'            },
            {                name:'アラハバキ',    name_tw:'荒霸吐',            rarity:3,                grade:50, icon:'jyasin_arahabaki.png', skills:["メギド","マカラカーン","コンセントレイト"], skill4:["エナジードレイン","アイスブレス","メポズムディ","マカラカシフト","氷結無効"], skill5:["","なぎ払い","乱れ狂い","ムド","メチャームディ"],elements:["耐","弱","弱","弱","弱","耐","耐"], type:'攻擊'            },
            {                name:'バフォメット',  name_tw:'巴風特',              rarity:3,                grade:41, icon:'jyasin_bahuometo.png', skills:["マハムド","吸血","マハラギ"], skill4:["二分の魔脈","ムドダイン","マハポイズマ","呪殺ブースタ","破魔耐性"], skill5:["","暴れまくり","マハブフ","野生の勘","ジオ"],elements:["","","","","","弱","無"], type:'攻擊'            },
            {                name:'アブラクサス',  name_tw:'亞布拉薩',              rarity:2,                grade:26, icon:'jyasin_aburakusasu.png', skills:["デクンダ","タルカジャ","ブフーラ"], skill4:["ラクカジャ","金剛発破","アムリタ","地獄のマスク","呪殺無効"], skill5:["","マハラギ","初段の賢魔","マハラギ","乱れ狂い"],elements:["吸","弱","弱","弱","弱","弱","弱"], type:'支援'            }
        ]
    },
    {
        name:'妖獸',
        formulas:[
            ['幻魔','大天使'],
            //['妖精','魔獸'],        //180419 remove
            ['妖鬼','大天使'],
            ['鬼女','墮天使'],
            ['夜魔','魔神'],
            ['邪神','妖魔'],
            ['外道','靈鳥'],      //180419 add
            ['外道','魔獸'],
            ['外道','妖鬼'],
            ['外道','鬼女'],
            ['魔王','大天使'],
            ['幽鬼','地母神'],
            ['幽鬼','妖魔'],
            ['幽鬼','魔獸']
        ],
        devils:[
            {                name:'フェンリル',    name_tw:'芬里爾',            rarity:4,                grade:61, icon:'youjyuu_huenriru.png', skills:["虚空爪激","二段の猛速","タルカオート"], skill4:["丸かじり","冥界破","マカラコワース","スピードスター","衝撃耐性"], skill5:["","呪殺耐性","丸かじり","メウィークディ","ハマ"],elements:["","弱","吸","耐","弱","",""], type:"支援"            },
            {                name:'ピアレイ',     name_tw:'皮亞雷',           rarity:3,                grade:46, icon:'youjyuu_piarei.png', skills:["マハデゾレト","狂い咲き","マハムドオン"], skill4:["毒ガスブレス","イービルアイ","コンセントレイト","地獄のマスク","破魔耐性"], skill5:["","ジオ","マハラギ","初段の猛速","毒床歩き"],elements:["","弱","耐","","","弱",""], type:"支援"            },
            {                name:'モスマン',     name_tw:'天蛾人',           rarity:3,                grade:41, icon:'youjyuu_mosuman.png', skills:["緊縛耐性","マハジオ","マハシバブー"], skill4:["一分の魔脈","ジオダイン","シバブオン","狂い咲き","火炎無効"], skill5:["","ザン","ヒートウェイブ","見切り","メパララディ"],elements:["","","","耐","弱","",""], type:"支援"            },
            {                name:'ヌエ',         name_tw:'鵺',       rarity:2,                grade:25, icon:'youjyuu_nue.png', skills:["マハジオ","ジオ","丸かじり"], skill4:["バインドクロー","ジオンガ","ラクンダ","初段の剛力","物理耐性"], skill5:["","メカースディ","スラッシュ","ポズムディ","野生の勘"],elements:["","","","耐","弱","",""], type:"攻擊"            },
            {                name:'ライジュウ',    name_tw:'雷獸',            rarity:2,                grade:20, icon:'youjyuu_raijyuu.png', skills:["虚弱耐性","ジオンガ","放電"], skill4:["食いしばり","バインドクロー","バリアコワース","初段の猛速","電撃無効"], skill5:["","ハマ","クロズディ","初段の恵体","クロズディ"],elements:["","","","耐","弱","",""], type:"支援"            },
            {                name:'バイコーン',    name_tw:'雙角獸',            rarity:1,                grade:9, icon:'youjyuu_baikon.png', skills:["突撃","アギ",""], skill4:["マハラギ","ヒートウェイブ","チャームディ","地獄のマスク","破魔耐性"], skill5:["","ディア","メパララディ","メディア","メウィークディ"],elements:["","","","","弱","","無"], type:"攻擊"            },
            {                name:'チャグリン',    name_tw:'恰古林',            rarity:1,                grade:4, icon:'youjyuu_tyagurinn.png', skills:["ウィークディ","ジオ",""], skill4:["放電","マハジオ","スクカジャ","初段の猛速","呪殺耐性"], skill5:["","百発百中","暴れまくり","ヒートウェイブ","ポズムディ"],elements:["","弱","","耐","","",""], type:"支援"            }
        ]
    },
    {
        name:'外道',
        formulas:[
            ['妖精','地母神'],
            ['鬼女','天使'],
            ['鬼女','魔獸'],
            ['夜魔','破壞神'],
            ['妖獸','妖精'],
            ['幽鬼','妖鬼'],
            ['幽鬼','鬼女'],
            ['幽鬼','邪神']
        ],
        devils:[
            {                name:'マッドガッサー',     name_tw:'毒氣怪客',           rarity:3,                grade:45, icon:'gedou_madogasa.png', skills:["マハポイズマ","毒追撃","ムドダイン"], skill4:["地獄のマスク","デスタッチ","バリアコワース","乱れ狂い","呪殺無効"], skill5:["","ジオ","ハマ","スクカジャ","メチャームディ"],elements:["","","","","","弱","耐"],type:"支援"            },
            {                name:'シャドウ',          name_tw:'黑影',      rarity:2,                grade:35, icon:'gedou_syadou.png', skills:["ラクンダ","マハジオ","ムド"], skill4:["タルカジャ","ムドオン","デゾレト","初段の猛速","氷結耐性"], skill5:["","地獄のマスク","マハムド","ジオ","初段の強運"],elements:["耐","","","","弱","弱","無"],type:"支援"            },
            {                name:'ブラックウーズ',    name_tw:'黑泥怪',            rarity:2,                grade:25, icon:'gedou_burakuuzu.png', skills:["ジュ","ポイズマ","甘噛み"], skill4:["乱れ狂い","デスタッチ","マハジュ","食いしばり","火炎無効"],skill5:["","マハザン","ヒートウェイブ","メウィークディ","メカースディ"], elements:["耐","","","弱","","弱","無"],type:"支援"            },
            {                name:'ブロブ',           name_tw:'果凍怪',     rarity:2,                grade:20, icon:'gedou_burobu.png', skills:["ポイズマ","ザン","マハザン"], skill4:["タルンダ","吸魔","マハポイズマ","乱れ狂い","衝撃耐性"], skill5:["","ウィークディ","ブフ","マハムド","ジオ"],elements:["耐","","弱","","","弱","無"],type:"支援"            },
            {                name:'ファントム',       name_tw:'鬼魅',         rarity:1,               grade:10, icon:'gedou_huantomu.png', skills:["ジオ","ムド","マハジオ"], skill4:["マハジオ","ジオンガ","デカジャ","地獄のマスク","電撃耐性"], skill5:["","初段の強運","パララディ","マハムド","マハブフ"],elements:["耐","","","","弱","弱","無"],type:"攻擊"            },
            {                name:'スライム',        name_tw:'軟泥怪',        rarity:1,                grade:1, icon:'gedou_suraimu.png', skills:["スラッシュ","一分の活泉",""], skill4:["吸血","吸魔","ポズムディ","反撃","衝撃耐性"], skill5:["","なぎ払い","野生の勘","初段の猛速","毒床歩き"],elements:["弱","弱","弱","弱","弱","弱",""],type:"攻擊"            }
        ]
    },
    {
        name:'魔王',
        formulas:[
            ['幻魔','魔神'],
            ['破壞神','大天使'],
            ['破壞神','魔神'],
            ['鬼神','地母神'],
            ['龍王','破壞神'],
            ['墮天使','破壞神'],
            ['邪神','破壞神']
        ],
        devils:[
            {                name:'ルシファー',     name_tw:'露西法',           rarity:5,                grade:98, icon:'maou_rusifua.png', skills:["メギドラオン","トリスアギオン","明けの明星"], skill4:["三段の恵体","ティタノマキア","リカームドラ","大虐殺者","破魔吸収"], skill5:["","ムドダイン","魅了無効","電撃ブースタ","マリンカリオン"],elements:["耐","","","","","弱","反"], type:'攻擊'            },
            {                name:'マーラ',         name_tw:'魔羅',       rarity:5,                grade:90, icon:'maou_mara.png', skills:["緊縛無効","ティタノマキア","地獄突き"], skill4:["メガトンレイド","ソウルドレイン","チャージ","物理貫通","氷結無効"], skill5:["","真理の雷","デゾレトオン","マハマカジャオン","地獄の業火"],elements:["","","弱","吸","","耐","耐"], type:'攻擊'            },
            {                name:'スルト',         name_tw:'史爾特爾',      rarity:5,                grade:83, icon:'maou_suruto.png', skills:["怪力乱神","テトラカシフト","ラグナロク"], skill4:["威圧の構え","マハラギダイン","リディア","火炎貫通","氷結無効"], skill5:["","毒追撃","衝撃ブースタ","ラクンダ","丸かじり"],elements:["","吸","弱","","","",""], type:'攻擊'            },
            {                name:'ロキ',           name_tw:'洛基',     rarity:4,                grade:75, icon:'maou_roki.png', skills:["ザンダイン","アギダイン","トリックスター"], skill4:["ジオダイン","ブフダイン","祟り","ダークゾーン無効","破魔耐性"], skill5:["","コロシの愉悦","丸かじり","マハムドオン","ムドオン"],elements:["","","無","","耐","弱","耐"], type:'攻擊'           },
            {                name:'ベルゼブブ',     name_tw:'別西卜',           rarity:4,                grade:68, icon:'maou_beruzebubu.png', skills:["ムドダイン","マハジオンガ","暴食の大罪"], skill4:["野獣の勘","ショックウェーブ","アウトブレイク","マカラカシフト","破魔反射"], skill5:["","マハデゾレトオン","物理耐性","コロシの愉悦","電撃耐性"],elements:["","","","耐","耐","無","無"], type:'攻擊'            },
            {                name:'アバドン',       name_tw:'阿巴頓',         rarity:4,                grade:60, icon:'maou_abadon.png', skills:["猛反撃","マハラギオン","暴飲暴食"], skill4:["地獄の業火","メガトンレイド","マハデゾレト","コロシの愉悦","物理無効"], skill5:["","初段の猛速","地獄のマスク","ジュ","メクロズディ"],elements:["","反","","弱","","",""], type:'攻擊'            },
            {                name:'オーカス',       name_tw:'奧迦斯',         rarity:3,                grade:46, icon:'maou_okasu.png', skills:["食いしばり","猛反撃","地獄の業火"], skill4:["ラクカオート","捨て身の一撃","テトラコワース","二段の恵体","氷結無効"], skill5:["","マハブフ","ザン","野生の勘","自然治癒"],elements:["耐","","弱","","","弱",""], type:'攻擊'            }
        ]
    },
    {
        name:'幽鬼',
        formulas:[
            ['魔獸','女神'],
            ['妖精','女神'],
            ['邪神','大天使'],
            ['邪神','妖鬼'],
            ['妖獸','大天使'],
            ['妖獸','破壞神'],
            ['妖獸','地母神'],
            ['外道','妖精'],
            ['外道','邪神'],
            ['魔王','女神'],
            ['魔王','鬼神'],
            ['魔王','妖鬼'],
            ['魔王','邪神']
        ],
        devils:[
            {                name:'ヴェータラ',        name_tw:'毘陀羅',        rarity:3,                grade:55, icon:'yuuki_vetara.png', skills:["リディアコワース","ブフダイン","丸かじり"], skill4:["暴れまくり","エナジードレイン","溶解ブレス","毒耐性","火炎耐性"], skill5:["","カースディ","初段の猛速","ヒートウェイブ","初段の猛速"],elements:["","弱","","","","弱","無"], type:"攻擊"            },
            {                name:'ラフィン・スカル',   name_tw:'笑面骷髏',             rarity:3,                grade:44, icon:'yuuki_rahuinsukaru.png', skills:["ディスコード","ムドオン","デスタッチ"], skill4:["デカジャ","冥界破","雄叫び","緊縛無効","衝撃耐性"], skill5:["","なぎ払い","ポズムディ","暴れまくり","マハジオ"],elements:["","吸","弱","","","弱","無"], type:"支援"            },
            {                name:'レギオン',          name_tw:'惡靈軍團',      rarity:2,                grade:34, icon:'yuuki_region.png', skills:["マハザン","ムド","アギ"], skill4:["デスバウンド","ウィンドブレス","マカラコワース","衝撃ブースタ","火炎耐性"], skill5:["","初段の強運","ヒートウェイブ","マハブフ","メウィークディ"],elements:["","","","弱","","弱","耐"], type:"攻擊"            },
            {                name:'ピシャーチャ',      name_tw:'畢舍遮',          rarity:2,                grade:26, icon:'yuuki_pisyatya.png', skills:["マハムド","甘噛み","吸血"], skill4:["ジュ","ムドオン","マハシバブー","毒床渡り","氷結耐性"], skill5:["","スラッシュ","地獄のマスク","ハマ","百発百中"],elements:["","弱","","","無","弱","耐"], type:"支援"            },
            {                name:'モウリョウ',        name_tw:'魍魎',        rarity:2,                grade:20, icon:'yuuki_mouryou.png', skills:["ムド","シバブオン","ファイアブレス"], skill4:["吸魔","イービルアイ","カースディ","初段の賢魔","呪殺反射"], skill5:["","ウィークディ","暴れまくり","メクロズディ","見切り"],elements:["","","","","","弱","無"], type:"攻擊"            },
            {                name:'オバリヨン',        name_tw:'背負小鬼',        rarity:1,                grade:7, icon:'yuuki_obariyon.png', skills:["クロズディ","メディア",""], skill4:["突撃","暴れまくり","スクンダ","見切り","火炎耐性"], skill5:["","乱れ狂い","メカースディ","地獄のマスク","マハンマ"],elements:["","","弱","耐","","弱","無"], type:"回復"            },
            {                name:'ガキ',             name_tw:'餓鬼',   rarity:1,                grade:4, icon:'yuuki_gaki.png', skills:["ブフ","ムド",""], skill4:["マハブフ","吸血","ディスコード","百発百中","衝撃耐性"], skill5:["","ヒートウェイブ","メパララディ","マハムド","初段の剛力"],elements:["","弱","耐","","弱","弱","無"], type:"攻擊"            }
        ]
    },
    {
        name:'魔人',
        formulas:[],
        devils:[
            { name:'トランペッター', name_tw:'吹號者', rarity:5, grade:94, icon:'majin_toranpeta.png', skills:['コンセントレイト','ソウルドレイン','アポカリプス'], skill4:['マハマカジャオン','ジャッジメント','祟り','ラクカオート','物理耐性'], skill5:['','タルカジャ','マハブフーラ','空間殺法','火炎耐性'], elements:['','','','','','無','無'], type:'攻擊'},
            { name:'アリス', name_tw:'愛麗絲', rarity:5, grade:89, icon:'majin_arisu.png', skills:['マハムドオン','ムドダイン','死んでくれる？'], skill4:['ソウルドレイン','ヘルズアイ','マハジュオン','呪殺ハイブースタ','破魔反射'], skill5:['','絶対零度','マハブフダイン','呪い耐性','刹那五月雨撃ち'], elements:['','','','','','弱','反'], type:'攻擊'},
            {   name:'ワイトナイト', name_tw:'白騎士', rarity:4, grade:74, icon:'majin_waitonaito.png', skills:['ジオダイン','ホワイトノイズ','ゴッドアロー'], skill4:['ショックウェーブ','ソウルドレイン','リカームドラ','緊縛無効','衝撃無効'], skill5:['','ブフーラ','百発百中','ヒートウェイブ','ブフ'], elements:['','','','吸','弱','耐','耐'], type:'攻擊'}
        ]
    },
    {
        name:'英雄',
        formulas:[],
        devils:[
            { name:'ヨシツネ', name_tw:'義經', rarity:5, grade:97, icon:'eiyuu_yositune.png', skills:['空間殺法','勝利のチャクラ','八艘飛び'], skill4:['不屈の闘志','ギガントマキア','テトラカーン','物理ハイブースタ','物理吸収'], skill5:['','マハマカジャマ','マハブフダイン','殺風激','ウィンドブレス'], elements:['耐','','','','','無','無'], type:'攻擊'},
            { name:'ジークフリード', name_tw:'齊格飛', rarity:5, grade:83, icon:'eiyuu_jikuhurito.png', skills:['怪力乱神','リベリオン','武道の素養'], skill4:['勝利の息吹','ティタノマキア','チャージ','不屈の闘志','衝撃無効'], skill5:['','マハジオダイン','トリスアギオン','メギドラ','イービルアイ'], elements:['吸','','','','','',''], type:'攻擊'}
        ]
    },
    {
        name:'怪異',
        formulas:[],
        devils:[
            { name:'かみおとこ', name_tw:'啃咬魔', rarity:2, grade:25, icon:'kaii_kamiotoko.png', skills:['ムドオン','狂い咲き','痺れかみつき'], skill4:['雄叫び','丸かじり','ディスコード','初段の強運','衝撃無効'], skill5:['','暴れまくり','ディア','マハンマ','コロシの愉悦'], elements:['','','','','','弱','反'], type:'支援'}
        ]
    },
    {
        name:'珍獣',
        formulas:[],
        devils:[
            { name:'イナバシロウサギ', name_tw:'因幡白兔', rarity:3, grade:41, icon:'tinjyuu_inabasirousagi.png', skills:['デカジャ','メディア','ワナフーリ'], skill4:['リカーム','狂乱の剛爪','ディスコード','初段の猛速','火炎無効'], skill5:['','マハムド','マハンマ','メカースディ','メウィークディ'], elements:['','弱','','','','',''], type:'回復'},
            { name:'チュパカブラ', name_tw:'卓柏卡布拉', rarity:1, grade:15, icon:'tinjyuu_typakabura.png', skills:['マハザン','ステルス','ワナフーリ'], skill4:['スクカオート','吸魔','パララディ','地獄のマスク','電撃耐性'], skill5:['','マハムド','メディア','初段の恵体','野生の勘'], elements:['','','','弱','','',''], type:'攻擊'}
        ]
    },
    {
        name:'秘神',
        formulas:[],
        devils:[
            { name:'カーマ', name_tw:'伽摩', rarity:4, grade:75, icon:'hisin_kama.png', skills:['スピードスター','デクンダ','魅了の神弓'], skill4:['空間殺法','刹那五月雨撃ち','静寂の祈り','スクカオート','火炎反射'], skill5:['','衝撃耐性','メポズムディ','毒針','タルンダ'], elements:['耐','弱','','','','耐',''], type:'支援'},
            { name:'キンマモン', name_tw:'君真物', rarity:3, grade:55, icon:'hisin_kinmamon.png', skills:['メギド','バリア','マレビト'], skill4:['メギドラ','エナジードレイン','アムリタ','見切り','呪殺無効'], skill5:['','初段の恵体','毒床歩き','乱れ狂い','カースディ'], elements:['','無','弱','','','耐','耐'], type:'支援'},
            { name:'カンバリ', name_tw:'加牟波理', rarity:2, grade:30, icon:'hisin_kanbari.png', skills:['暴れまくり','ハマオン','コウウン'], skill4:['メガトンプレス','マハンマ','メカースディ','勝利のチャクラ','火炎耐性'], skill5:['','','','',''], elements:['弱','','','','','耐','弱'], type:'攻擊'}
        ]
    },
    {
        name:'狂神',
        formulas:[],
        devils:[
            { name:'アティス', name_tw:'阿提斯', rarity:4, grade:65, icon:'kyousin_ateisu.png', skills:['不屈の闘志','リカームドラ','乱・かすみ斬り'], skill4:['勝利の息吹','マハブフダイン','ディアラマ','魅了無効','氷結無効'], skill5:['','二段の猛速','マハラギオン','毒床歩き','メチャームディ'], elements:['耐','','','','','',''], type:'攻擊'}
        ]
    },
    {
        name:'威靈',
        formulas:[],
        devils:[
            { name:'アリラト', name_tw:'阿利拉特(暫)', rarity:5, grade:85, icon:'irei_arirato.png', skills:['メギドラ','奈落のマスク','貫反の霊圧'], skill4:['ディアラハン','','','',''], skill5:['','','','',''], elements:['耐','','','','','耐','耐'], type:'回復'}
        ]
    }
];

const skill_stable = [
    {
        name:"物理",
        name_tw:"物理",
        name_en:"",
        skills:[
            //物理
            {"name":"スラッシュ","name_tw":"斬擊","desc":"敵単体に物理属性の打撃型ダメージを威力120で与える。","mp":4,"point":1,"element":"物理"},
            {"name":"絶命剣","name_tw":"絕命劍","desc":"敵単体に物理属性の打撃型ダメージを威力140で与える。","mp":5,"point":6,"element":"物理"},
            {"name":"怪力乱神","name_tw":"怪力亂神","desc":"敵単体に物理属性の打撃型ダメージを威力160で与える。","mp":6,"point":9,"element":"物理"},
            {"name":"メガトンレイド","name_tw":"百萬噸襲擊","desc":"敵単体に物理属性の打撃型ダメージを威力180で与える。","mp":7,"point":"12","element":"物理"},
            {"name":"ゴッドハンド","name_tw":"神之手","desc":"敵単体に物理属性の打撃型ダメージを威力200で与える。","mp":8,"point":"15","element":"物理"},
            {"name":"なぎ払い","name_tw":"橫斬","desc":"敵全体に物理属性の打撃型ダメージを威力80で与える。","mp":4,"point":2,"element":"物理"},
            {"name":"金剛発破","name_tw":"金剛發破","desc":"敵全体に物理属性の打撃型ダメージを威力100で与える。","mp":5,"point":4,"element":"物理"},
            {"name":"冥界破","name_tw":"冥界破","desc":"敵全体に物理属性の打撃型ダメージを威力120で与える。","mp":6,"point":6,"element":"物理"},
            {"name":"空間殺法","name_tw":"空間殺法","desc":"敵全体に物理属性の打撃型ダメージを威力140で与える。","mp":7,"point":8,"element":"物理"},
            {"name":"ギガントマキア","name_tw":"巨人之戰","desc":"敵全体に物理属性の打撃型ダメージを威力160で与える。","mp":8,"point":"10","element":"物理"},
            {"name":"突撃","name_tw":"突擊","desc":"敵単体にクリティカル率30%の物理属性の打撃型ダメージを威力115で与える。","mp":4,"point":2,"element":"物理"},
            {"name":"鬼神楽","name_tw":"鬼神樂","desc":"敵単体にクリティカル率30%の物理属性の打撃型ダメージを威力130で与える。","mp":5,"point":5,"element":"物理"},
            {"name":"モータルジハード","name_tw":"絕命鬥爭","desc":"敵単体にクリティカル率30%の物理属性の打撃型ダメージを威力145で与える。","mp":6,"point":7,"element":"物理"},
            {"name":"ヒートウェイブ","name_tw":"灼熱波浪","desc":"敵全体にクリティカル率30%の物理属性の打撃型ダメージを威力70で与える。","mp":5,"point":2,"element":"物理"},
            {"name":"メガトンプレス","name_tw":"百萬噸重壓","desc":"敵全体にクリティカル率30%の物理属性の打撃型ダメージを威力90で与える。","mp":6,"point":4,"element":"物理"},
            {"name":"ティタノマキア","name_tw":"泰坦之戰","desc":"敵全体にクリティカル率30%の物理属性の打撃型ダメージを威力110で与える。","mp":7,"point":6,"element":"物理"},
            {"name":"暴れまくり","name_tw":"橫衝直撞","desc":"ランダムな敵に２～３回、物理属性の打撃型ダメージを威力45で与える。","mp":3,"point":3,"element":"物理"},
            {"name":"デスバウンド","name_tw":"神威之擊","desc":"ランダムな敵に２～３回、物理属性の打撃型ダメージを威力55で与える。","mp":4,"point":5,"element":"物理"},
            {"name":"狂乱の剛爪","name_tw":"狂亂硬爪","desc":"ランダムな敵に２～３回、物理属性の打撃型ダメージを威力65で与える。","mp":5,"point":7,"element":"物理"},
            {"name":"地獄の獰爪","name_tw":"地獄兇爪","desc":"ランダムな敵に3回、クリティカル率30％の物理属性の打撃型ダメージを威力65で与える。","mp":5,"point":7,"element":"物理"},
            {"name":"虚空爪激","name_tw":"虛空爪激","desc":"ランダムな敵に２～３回、物理属性の打撃型ダメージを威力75で与える。","mp":6,"point":9,"element":"物理"},
            {"name":"五月雨斬り","name_tw":"五月雨斬","desc":"ランダムな敵に２～５回、物理属性の打撃型ダメージを威力50で与える。","mp":5,"point":7,"element":"物理"},
            {"name":"刹那五月雨撃ち","name_tw":"剎那五月雨擊","desc":"ランダムな敵に２～５回、物理属性の打撃型ダメージを威力65で与える。","mp":7,"point":9,"element":"物理"},
            {"name":"毒針","name_tw":"毒針","desc":"敵単体に物理属性の打撃型ダメージを威力120で与え、基礎確率40%で毒状態にする。","mp":5,"point":6,"element":"物理"},
            {"name":"バインドクロー","name_tw":"束縛爪擊","desc":"敵単体に物理属性の打撃型ダメージを威力120で与え、基礎確率40%で緊縛状態にする。","mp":5,"point":6,"element":"物理"},
            {"name":"暗夜剣","name_tw":"暗夜劍","desc":"敵単体に物理属性の打撃型ダメージを威力120で与え、基礎確率40%で魔封状態にする。","mp":5,"point":6,"element":"物理"},
            {"name":"甘噛み","name_tw":"甜蜜輕咬","desc":"敵単体に物理属性の打撃型ダメージを威力120で与え、基礎確率40%で魅了状態にする。","mp":5,"point":6,"element":"物理"},
            {"name":"丸かじり","name_tw":"大快朵頤","desc":"敵単体に物理属性の打撃型ダメージを威力120で与え、そのダメージの25%分、自身を回復する。","mp":5,"point":6,"element":"物理"},
            {"name":"暴飲暴食","name_tw":"暴飲暴食","desc":"敵単体に物理属性の打撃型ダメージを威力140で与え、そのダメージの40%分、自身を回復する。","mp":6,"point":8,"element":"物理"},
            {"name":"捨て身の一撃","name_tw":"捨身一擊","desc":"自身のＨＰを10%消費して、敵単体に物理属性の打撃型ダメージを威力170で与える。","mp":7,"point":6,"element":"物理"},
            {"name":"八艘飛び","name_tw":"八艘跳躍","desc":"ランダムな敵に８回、物理属性の打撃型ダメージを威力35で与える。","mp":7,"point":null,"element":"物理"},
            {"name":"乱・かすみ斬り","name_tw":"亂・霞霧斬擊","desc":"敵に3～5回、物理属性の打撃型ダメージを威力50で与える","mp":6,"point":null,"element":"物理"},
            {"name":"ゲイボルグ","name_tw":"千棘魔槍","desc":"ランダムな敵に４～６回、物理属性の打撃型ダメージを威力50で与える。","mp":7,"point":null,"element":"物理"},
            {"name":"地獄突き","name_tw":"地域刺擊","desc":"ランダムな敵に４回、物理属性の打撃型ダメージを威力35で与え、基礎確率35％で魅了状態にする。","mp":7,"point":null,"element":"物理"},
            {"name":"痺れかみつき","name_tw":"麻痺咬痕","desc":"敵単体に物理属性の打撃型ダメージを威力160で与え、基礎確率35％で緊縛状態にする。","mp":5,"point":null,"element":"物理"},
            {"name":"グングニル","name_tw":"永恆之槍","desc":"敵全体にクリティカル率30％の物理属性の打撃型ダメージを威力145で与える。","mp":7,"point":null,"element":"物理"}
        ]
    },
    {
        name:"火炎",
        name_tw:"火炎",
        name_en:"",
        skills:[
            //火
            {"name":"アギ","name_tw":"亞基","desc":"敵単体に火炎属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"火炎"},
            {"name":"アギラオ","name_tw":"亞基拉歐","desc":"敵単体に火炎属性の魔法型ダメージを威力140で与える。","mp":5,"point":6,"element":"火炎"},
            {"name":"アギダイン","name_tw":"亞基達因","desc":"敵単体に火炎属性の魔法型ダメージを威力160で与える。","mp":6,"point":null,"element":"火炎"},
            {"name":"トリスアギオン","name_tw":"多利斯亞基翁","desc":"敵単体に火炎属性の魔法型ダメージを威力180で与える。","mp":7,"point":null,"element":"火炎"},
            {"name":"マハラギ","name_tw":"瑪哈拉基","desc":"敵全体に火炎属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"火炎"},
            {"name":"マハラギオン","name_tw":"瑪哈拉基翁","desc":"敵全体に火炎属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"火炎"},
            {"name":"マハラギダイン","name_tw":"瑪哈拉基達因","desc":"敵全体に火炎属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"火炎"},
            {"name":"ファイアブレス","name_tw":"火焰吐息","desc":"ランダムな敵に２～４回、火炎属性の魔法型ダメージを威力40で与える。","mp":4,"point":7,"element":"火炎"},
            {"name":"地獄の業火","name_tw":"地獄業火","desc":"ランダムな敵に２～４回、火炎属性の魔法型ダメージを威力50で与える。","mp":5,"point":"10","element":"火炎"},
            {"name":"ラグナロク","name_tw":"諸神的黃昏","desc":"敵単体に火炎属性の魔法型ダメージを威力215で与える。","mp":7,"point":null,"element":"火炎"}
        ]
    },
    {
        name:"氷結",
        name_tw:"冰凍",
        name_en:"",
        skills:[
            //冰
            {"name":"ブフ","name_tw":"布芙","desc":"敵単体に氷結属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"氷結"},
            {"name":"ブフーラ","name_tw":"布芙拉","desc":"敵単体に氷結属性の魔法型ダメージを威力140で与える。","mp":"5","point":"6","element":"氷結"},
            {"name":"ブフダイン","name_tw":"布芙達因","desc":"敵単体に氷結属性の魔法型ダメージを威力160で与える。","mp":6,"point":9,"element":"氷結"},
            {"name":"アイスエイジ","name_tw":"大冰河時期","desc":"敵単体に氷結属性の魔法型ダメージを威力180で与える。","mp":7,"point":null,"element":"氷結"},
            {"name":"マハブフ","name_tw":"瑪哈布芙","desc":"敵全体に氷結属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"氷結"},
            {"name":"マハブフーラ","name_tw":"瑪哈布芙拉","desc":"敵全体に氷結属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"氷結"},
            {"name":"マハブフダイン","name_tw":"瑪哈布芙達因","desc":"敵全体に氷結属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"氷結"},
            {"name":"アイスブレス","name_tw":"極寒吐息","desc":"ランダムな敵に２〜４回、氷結属性の魔法型ダメージを威力40で与える。","mp":4,"point":7,"element":"氷結"},
            {"name":"絶対零度","name_tw":"絕對零度","desc":"ランダムな敵に２～４回、氷結属性の魔法型ダメージを威力50で与える。","mp":5,"point":null,"element":"氷結"}
        ]
    },
    {
        name:"電撃",
        name_tw:"電擊",
        name_en:"",
        skills:[
            //雷
            {"name":"ジオ","name_tw":"吉歐","desc":"敵単体に電撃属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"電撃"},
            {"name":"ジオンガ","name_tw":"吉歐加","desc":"敵単体に電撃属性の魔法型ダメージを威力140で与える。","mp":5,"point":6,"element":"電撃"},
            {"name":"ジオダイン","name_tw":"吉歐達因","desc":"敵単体に電撃属性の魔法型ダメージを威力160で与える。","mp":6,"point":null,"element":"電撃"},
            {"name":"真理の雷","name_tw":"真理之雷","desc":"敵単体に電撃属性の魔法型ダメージを威力180で与える。","mp":"7","point":null,"element":"電撃"},
            {"name":"マハジオ","name_tw":"瑪哈吉歐","desc":"敵全体に電撃属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"電撃"},
            {"name":"マハジオンガ","name_tw":"瑪哈吉歐加","desc":"敵全体に電撃属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"電撃"},
            {"name":"マハジオダイン","name_tw":"瑪哈吉歐達因","desc":"敵全体に電撃属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"電撃"},
            {"name":"放電","name_tw":"放電","desc":"ランダムな敵に２〜４回、電撃属性の魔法型ダメージを威力40で与える。","mp":4,"point":7,"element":"電撃"},
            {"name":"ショックウェーブ","name_tw":"衝擊波","desc":"ランダムな敵に２〜４回、電撃属性の魔法型ダメージを威力50で与える。","mp":5,"point":null,"element":"電撃"},
            {"name":"ミョルニル","name_tw":"雷神之槌","desc":"ランダムな敵に３～５回、電撃属性の魔法型ダメージを威力60で与える。","mp":7,"point":null,"element":"電撃"}
        ]
    },
    {
        name:"衝撃",
        name_tw:"衝擊",
        name_en:"",
        skills:[
            //衝
            {"name":"ザン","name_tw":"颯","desc":"敵単体に衝撃属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"衝撃"},
            {"name":"ザンマ","name_tw":"颯瑪","desc":"敵単体に衝撃属性の魔法型ダメージを威力140で与える。","mp":5,"point":6,"element":"衝撃"},
            {"name":"ザンダイン","name_tw":"颯達因","desc":"敵単体に衝撃属性の魔法型ダメージを威力160で与える。","mp":6,"point":9,"element":"衝撃"},
            {"name":"殺風激","name_tw":"殺風激","desc":"敵単体に衝撃属性の魔法型ダメージを威力180で与える。","mp":7,"point":null,"element":"衝撃"},
            {"name":"マハザン","name_tw":"瑪哈颯","desc":"敵全体に衝撃属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"衝撃"},
            {"name":"マハザンマ","name_tw":"瑪哈颯瑪","desc":"敵全体に衝撃属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"衝撃"},
            {"name":"マハザンダイン","name_tw":"瑪哈颯達因","desc":"敵全体に衝撃属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"衝撃"},
            {"name":"ウィンドブレス","name_tw":"狂風吐息","desc":"ランダムな敵に２～４回、衝撃属性の魔法型ダメージを威力40で与える。","mp":4,"point":7,"element":"衝撃"},
            {"name":"ツイスター","name_tw":"龍捲風","desc":"ランダムな敵に２～４回、衝撃属性の魔法型ダメージを威力50で与える。","mp":5,"point":null,"element":"衝撃"},
            {"name":"天叢雲剣","name_tw":"","desc":"敵単体に衝撃属性の魔法型ダメージを威力205で与え、３ターンの間、味方全体の攻撃力を20％増加させる。","mp":7,"point":null,"element":"衝撃"}
        ]
    },
    {
        name:"破魔",
        name_tw:"破魔",
        name_en:"",
        skills:[
            //破魔
            {"name":"ハマ","name_tw":"哈瑪","desc":"敵単体に破魔属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"破魔"},
            {"name":"ハマオン","name_tw":"哈瑪翁","desc":"敵単体に破魔属性の魔法型ダメージを威力140で与える。","mp":5,"point":6,"element":"破魔"},
            {"name":"ハマダイン","name_tw":"哈瑪達因","desc":"敵単体に破魔属性の魔法型ダメージを威力160で与える。","mp":6,"point":9,"element":"破魔"},
            {"name":"裁きの雷火","name_tw":"制裁雷火","desc":"敵単体に破魔属性の魔法型ダメージを威力180で与える。","mp":7,"point":null,"element":"破魔"},
            {"name":"マハンマ","name_tw":"瑪哈瑪","desc":"敵全体に破魔属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"破魔"},
            {"name":"マハンマオン","name_tw":"瑪哈瑪翁","desc":"敵全体に破魔属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"破魔"},
            {"name":"マハンマダイン","name_tw":"瑪哈瑪達因","desc":"敵全体に破魔属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"破魔"},
            {"name":"審判の光","name_tw":"審判之光","desc":"敵ランダムに２～４回、破魔属性の魔法型ダメージを威力40で与える。","mp":7,"point":7,"element":"破魔"},
            {"name":"天罰","name_tw":"天譴","desc":"ランダムな敵に２～４回、破魔属性の魔法型ダメージを威力50で与える。","mp":5,"point":null,"element":"破魔"},
            {"name":"ゴッドアロー","name_tw":"神差箭矢","desc":"敵単体に破魔属性の魔法型ダメージを威力200で与え、50％の確率で死亡させる。","mp":7,"point":null,"element":"破魔"}
        ]
    },
    {
        name:"呪殺",
        name_tw:"咒殺",
        name_en:"",
        skills:[
            //呪殺
            {"name":"ムド","name_tw":"姆多","desc":"敵単体に呪殺属性の魔法型ダメージを威力120で与える。","mp":4,"point":1,"element":"呪殺"},
            {"name":"ムドオン","name_tw":"姆多翁","desc":"敵単体に呪殺属性の魔法型ダメージを威力140で与える。","mp":5,"point":6,"element":"呪殺"},
            {"name":"ムドダイン","name_tw":"姆多達因","desc":"敵単体に呪殺属性の魔法型ダメージを威力160で与える。","mp":6,"point":9,"element":"呪殺"},
            {"name":"ヘルズアイ","name_tw":"地獄之眼","desc":"敵単体に呪殺属性の魔法型ダメージを威力180で与える。","mp":6,"point":null,"element":"呪殺"},
            {"name":"マハムド","name_tw":"瑪哈姆多","desc":"敵全体に呪殺属性の魔法型ダメージを威力80で与える。","mp":5,"point":2,"element":"呪殺"},
            {"name":"マハムドオン","name_tw":"瑪哈姆多翁","desc":"敵全体に呪殺属性の魔法型ダメージを威力100で与える。","mp":6,"point":6,"element":"呪殺"},
            {"name":"マハムドダイン","name_tw":"瑪哈姆多達因","desc":"敵全体に呪殺属性の魔法型ダメージを威力120で与える。","mp":7,"point":null,"element":"呪殺"},
            {"name":"イービルアイ","name_tw":"邪惡之眼","desc":"ランダムな敵に２～４回、呪殺属性の魔法型ダメージを威力40で与える。","mp":4,"point":7,"element":"呪殺"},
            {"name":"煉獄","name_tw":"煉獄","desc":"ランダムな敵に２～４回、呪殺属性の魔法型ダメージを威力50で与える。","mp":5,"point":null,"element":"呪殺"},
            {"name":"肉体の解放","name_tw":"肉體的解放","desc":"敵全体に呪殺属性の魔法型ダメージを威力90で与え、基礎確率25％で魅了状態にする。","mp":7,"point":null,"element":"呪殺"},
            {"name":"暴食の大罪","name_tw":"暴食重罪","desc":"敵全体に呪殺属性の魔法型ダメージを威力130で与え、そのダメージの50％分、自身を回復する。","mp":7,"point":null,"element":"呪殺"},
            {"name":"死んでくれる？","name_tw":"可以為我而死嗎？","desc":"敵単体を死亡させる。","mp":7,"point":null,"element":"呪殺"}
        ]
    },
    {
        name:"万能",
        name_tw:"萬能",
        name_en:"",
        skills:[
            //萬
            {"name":"吸血","name_tw":"吸血","desc":"敵単体に万能属性の魔法型ダメージを威力120で与え、そのダメージの25％分、自身を回復する。","mp":5,"point":3,"element":"万能"},
            {"name":"デスタッチ","name_tw":"死亡之觸","desc":"敵単体に万能属性の魔法型ダメージを威力140で与え、そのダメージの40％分、自身を回復する。","mp":6,"point":6,"element":"万能"},
            {"name":"吸魔","name_tw":"吸魔","desc":"敵単体に万能属性の魔法型ダメージを威力100で与え、MPを１奪う。","mp":6,"point":3,"element":"万能"},
            {"name":"エナジードレイン","name_tw":"能量抽取","desc":"敵単体に万能属性の魔法型ダメージを威力100で与え、そのダメージの25％分、自身を回復し、MPを１奪う。","mp":7,"point":6,"element":"万能"},
            {"name":"ソウルドレイン","name_tw":"靈魂抽取","desc":"敵単体に万能属性の魔法型ダメージを威力140で与え、そのダメージの40％分、自身を回復し、MPを１奪う。","mp":8,"point":7,"element":"万能"},
            {"name":"メギド","name_tw":"米吉朵","desc":"敵全体に万能属性の魔法型ダメージを威力80で与える。","mp":6,"point":5,"element":"万能"},
            {"name":"メギドラ","name_tw":"米吉朵拉","desc":"敵全体に万能属性の魔法型ダメージを威力100で与える。","mp":7,"point":8,"element":"万能"},
            {"name":"メギドラオン","name_tw":"米吉朵拉翁","desc":"敵全体に万能属性の魔法型ダメージを威力120で与える。","mp":8,"point":"12","element":"万能"},
            {"name":"混沌の海","name_tw":"混沌之海","desc":"敵全体に万能属性の魔法型ダメージを威力100で与え、3ターンの間、敵全体の防御力を20%減少させる。","mp":9,"point":null,"element":"万能"},
            {"name":"ジャッジメント","name_tw":"審判","desc":"敵全体に万能属性の魔法型ダメージを威力100で与え、3ターンの間、味方全体の攻撃力を20%増加させる。","mp":9,"point":"12","element":"万能"},
            {"name":"精神漏出","name_tw":"精神漏出","desc":"敵単体に万能属性の魔法型ダメージを威力80で与え、MPを３失わせる。","mp":5,"point":6,"element":"万能"},
            {"name":"シナイの神火","name_tw":"西奈的神火","desc":"ランダムな敵に５回、万能属性の魔法型ダメージを威力45で与える。","mp":7,"point":null,"element":"万能"},
            {"name":"プララヤ","name_tw":"大劫","desc":"敵全体に万能属性の魔法型ダメージを威力125で与える。","mp":8,"point":null,"element":"万能"},
            {"name":"アポカリプス","name_tw":"默示錄","desc":"敵全体に万能属性の魔法型ダメージを威力110で与え、基礎確率30％で魔封状態にする。","mp":8,"point":null,"element":"万能"},
            {"name":"明けの明星","name_tw":"拂曉明星","desc":"敵全体に万能属性の魔法型ダメージを威力135で与える。","mp":8,"point":null,"element":"万能"},
            {"name":"魅了の神弓","name_tw":"魅惑神弓","desc":"敵単体に万能属性の魔法型ダメージを威力190で与え、基礎確率45％で魅了状態にする。","mp":8,"point":null,"element":"万能"}
        ]
    },
    {
        name:"回復",
        namw_tw:"回復",
        name_en:"Heal",
        skills:[
            //回
            {"name":"ディア","name_tw":"迪亞","desc":"味方単体を回復力50で回復する。","mp":4,"point":1,"element":"無"},
            {"name":"ディアラ","name_tw":"迪亞拉","desc":"味方単体を回復力90で回復する。","mp":5,"point":5,"element":"無"},
            {"name":"ディアラマ","name_tw":"迪亞拉瑪","desc":"味方単体を回復力130で回復する。","mp":6,"point":8,"element":"無"},
            {"name":"ディアラハン","name_tw":"迪亞拉瑪翰","desc":"味方単体を回復力170で回復する。","mp":7,"point":"11","element":"無"},
            {"name":"メディア","name_tw":"梅迪亞","desc":"味方全体を回復力25で回復する。","mp":6,"point":2,"element":"無"},
            {"name":"メディラ","name_tw":"梅迪拉","desc":"味方全体を回復力60で回復する。","mp":7,"point":5,"element":"無"},
            {"name":"メディラマ","name_tw":"梅迪拉瑪","desc":"味方全体を回復力95で回復する。","mp":8,"point":8,"element":"無"},
            {"name":"メディアラハン","name_tw":"梅迪亞拉翰","desc":"味方全体を回復力130で回復する。","mp":9,"point":"11","element":"無"},
            {"name":"メシアライザー","name_tw":"救世主喚起者","desc":"味方全体を回復力95で回復し、状態異常を全て回復する。","mp":"10","point":"15","element":"無"},
            //持回
            {"name":"リディア","name_tw":"利迪亞","desc":"３回行動するまでの間、味方単体をリディア状態にし、行動する前にHPを回復する。","mp":4,"point":8,"element":"無"},
            {"name":"リディアコワース","name_tw":"利迪亞破壞","desc":"敵全体のリディア状態を解除する。","mp":3,"point":6,"element":"無"},
            //復活
            {"name":"リカーム","name_tw":"利卡姆","desc":"死亡している味方単体をHP10％で復活させる。","mp":6,"point":6,"element":"無"},
            {"name":"サマリカーム","name_tw":"薩瑪利卡姆","desc":"死亡している味方単体を完全回復で復活させる。","mp":8,"point":8,"element":"無"},
            {"name":"リカームドラ","name_tw":"利卡姆托拉","desc":"死亡している味方全体を完全回復で復活させるが、自身は死亡する。","mp":8,"point":"10","element":"無"},
            //解毒
            {"name":"ポズムディ","name_tw":"病毒解除術","desc":"味方単体の毒を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メポズムディ","name_tw":"梅波茲姆迪","desc":"味方全体の毒を回復する。","mp":4,"point":5,"element":"無"},
            //解封
            {"name":"クロズディ","name_tw":"克洛茲迪","desc":"味方単体の魔封を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メクロズディ","name_tw":"梅克洛茲迪","desc":"味方全体の魔封を回復する。","mp":4,"point":5,"element":"無"},
            //解縛
            {"name":"パララディ","name_tw":"帕拉拉迪","desc":"味方単体の緊縛を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メパララディ","name_tw":"梅帕拉拉迪","desc":"味方全体の緊縛を回復する。","mp":4,"point":5,"element":"無"},
            //解魅
            {"name":"チャームディ","name_tw":"查姆蒂","desc":"味方単体の魅了を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メチャームディ","name_tw":"梅查姆蒂","desc":"味方全体の魅了を回復する。","mp":4,"point":5,"element":"無"},
            //解呪
            {"name":"カースディ","name_tw":"卡斯迪","desc":"味方単体の呪いを回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メカースディ","name_tw":"梅卡斯迪","desc":"味方全体の呪いを回復する。","mp":4,"point":5,"element":"無"},
            //解虛
            {"name":"ウィークディ","name_tw":"溫坤迪","desc":"味方単体の虚弱を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メウィークディ","name_tw":"梅溫庫迪","desc":"味方全体の虚弱を回復する。","mp":4,"point":5,"element":"無"},
            //解異常
            {"name":"アムリタ","name_tw":"甘露","desc":"味方単体の状態異常を全て回復する。","mp":4,"point":3,"element":"無"},
            {"name":"常世の祈り","name_tw":"永恆的祈禱","desc":"味方全体の状態異常を全て回復する。","mp":5,"point":8,"element":"無"},
            {"name":"静寂の祈り","name_tw":"寂靜的禱告","desc":"敵味方全体の状態異常を全て回復する。","mp":7,"point":8,"element":"無"},
            //狀態
            {"name":"バリア","name_tw":"防壁","desc":"３ターンの間、味方単体をバリア状態にし、状態異常を無効にする。","mp":4,"point":8,"element":"無"},
            {"name":"バリアコワース","name_tw":"防壁破壞","desc":"敵全体のバリア状態を解除する。","mp":3,"point":6,"element":"無"}
        ]
    },
    {
        name:"異常",
        name_tw:"異常",
        name_en:"",
        skills:[
            //毒
            {"name":"ポイズマ","name_tw":"波伊佐瑪","desc":"敵単体を基礎確率40%で毒状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"ポイズマオン","name_tw":"波伊佐瑪翁","desc":"敵単体を基礎確率50%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハポイズマ","name_tw":"瑪哈波伊佐瑪","desc":"敵全体を基礎確率30%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハポイズマオン","name_tw":"瑪哈波伊佐瑪翁","desc":"敵全体を基礎確率30%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"毒ガスブレス","name_tw":"猛毒吐息","desc":"ランダムな敵を２〜４回、基礎確率30％で毒状態にする。","mp":6,"point":7,"element":"無"},
            //縛
            {"name":"シバブー","name_tw":"希巴縛","desc":"敵単体を基礎確率40%で緊縛状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"シバブオン","name_tw":"希巴縛翁","desc":"敵単体を基礎確率50%で緊縛状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハシバブー","name_tw":"瑪哈希巴縛","desc":"敵全体を基礎確率30%で緊縛状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハシバブオン","name_tw":"瑪哈希巴縛翁","desc":"敵全体を基礎確率40%で緊縛状態にする。","mp":7,"point":null,"element":"無"},
            {"name":"バインドボイス","name_tw":"束縛咆嘯","desc":"ランダムな敵を２～４回、基礎確率30%で緊縛状態にする。","mp":6,"point":null,"element":"無"},
            //魅
            {"name":"マリンカリン","name_tw":"瑪琳卡琳","desc":"敵単体を基礎確率40%で魅了状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"マリンカリオン","name_tw":"瑪琳卡琳翁","desc":"敵単体を基礎確率50%で魅了状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハマリンカリン","name_tw":"瑪哈瑪琳卡琳","desc":"敵全体を基礎確率30%で魅了状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハマリカリオン","name_tw":"瑪哈瑪琳卡琳翁","desc":"敵全体を基礎確率40%で魅了状態にする。","mp":7,"point":null,"element":"無"},
            {"name":"セクシーダンス","name_tw":"色誘之舞","desc":"ランダムな敵を２～４回、基礎確率30%で魅了状態にする。","mp":6,"point":7,"element":"無"},
            //封
            {"name":"マカジャマ","name_tw":"瑪卡加瑪","desc":"敵単体を基礎確率40%で魔封状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"マカジャマオン","name_tw":"瑪卡加瑪翁","desc":"敵単体を基礎確率40%で魔封状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハマカジャマ","name_tw":"瑪哈瑪卡加瑪","desc":"敵全体を基礎確率30%で魔封状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハマカジャオン","name_tw":"瑪哈瑪卡加瑪翁","desc":"敵全体を基礎確率40%で魔封状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"ホワイトノイズ","name_tw":"白茫噪音","desc":"ランダムな敵を２～４回、基礎確率30%で魔封状態にする。","mp":6,"point":7,"element":"無"},
            //呪
            {"name":"ジュ","name_tw":"祖","desc":"敵単体を基礎確率50％で呪い状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"ジュオン","name_tw":"祖翁","desc":"敵単体を基礎確率60％で呪い状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハジュ","name_tw":"瑪哈祖","desc":"敵全体を基礎確率40％で呪い状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハジュオン","name_tw":"瑪哈祖翁","desc":"敵全体を基礎確率50％で呪い状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"祟り","name_tw":"報應","desc":"ランダムな敵を１～４回、基礎確率40％で呪い状態にする。","mp":6,"point":7,"element":"無"},
            //虛
            {"name":"デゾレト","name_tw":"特奏累托","desc":"敵単体を基礎確率70％で虚弱状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"デゾレトオン","name_tw":"特奏累托翁","desc":"敵単体を基礎確率80％で虚弱状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハデゾレト","name_tw":"瑪哈特奏累托","desc":"敵全体を基礎確率60％で虚弱状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハデゾレトオン","name_tw":"瑪哈特奏累托翁","desc":"敵全体を基礎確率70％で虚弱状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"アウトブレイク","name_tw":"威力爆發","desc":"ランダムな敵を１～４回、基礎確率60％で虚弱状態にする。","mp":6,"point":7,"element":"無"}
        ]
    },
    {
        name:"增強",
        name_tw:"增強",
        name_en:"",
        skills:[
            //蓄力
            {"name":"チャージ","name_tw":"蓄力","desc":"自身をチャージ状態にし、次に与える打撃型ダメージを125％増加させる。","mp":6,"point":8,"element":"無"},
            {"name":"コンセントレイト","name_tw":"專注","desc":"自身をコンセントレイト状態にし、次に与える魔法型ダメージを125％増加させる。","mp":6,"point":8,"element":"無"},
            {"name":"リベリオン","name_tw":"反叛","desc":"自身を会心状態にし、次に行う打撃型攻撃を必ずクリティカルにする。","mp":6,"point":8,"element":"無"},
            {"name":"ディスコード","name_tw":"異調相斥","desc":"敵全体のチャージ、コンセントレイト、会心状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"バトンタッチ","name_tw":"下一位","desc":"自身のプレスターンアイコンを消費せずにパスを行う。","mp":3,"point":6,"element":"無"},
            //反射
            {"name":"テトラカーン","name_tw":"提特拉康","desc":"１ターンの間、味方全体を打撃型ダメージ反射状態にする。","mp":7,"point":8,"element":"無"},
            {"name":"マカラカーン","name_tw":"瑪卡拉康","desc":"１ターンの間、味方全体を魔法型ダメージ反射状態にする。","mp":7,"point":8,"element":"無"},
            {"name":"テトラコワース","name_tw":"提特拉破壞","desc":"敵全体の打撃型ダメージ反射状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"マカラコワース","name_tw":"瑪卡拉破壞","desc":"敵全体の魔法型ダメージ反射状態を解除する。","mp":3,"point":6,"element":"無"},
            //強弱化
            {"name":"タルカジャ","name_tw":"塔爾卡加","desc":"３ターンの間、味方全体の攻撃力を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"ラクカジャ","name_tw":"拉庫卡加","desc":"３ターンの間、味方全体の防御力を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"スクカジャ","name_tw":"斯庫卡加","desc":"３ターンの間、味方全体の回避と命中を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"タルンダ","name_tw":"塔倫達","desc":"３ターンの間、敵全体の攻撃力を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"ラクンダ","name_tw":"拉昆達","desc":"３ターンの間、敵全体の防御力を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"スクンダ","name_tw":"斯坤達","desc":"３ターンの間、敵全体の回避と命中を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"デカジャ","name_tw":"迪卡加","desc":"敵全体のステータス強化効果を解除する。","mp":5,"point":4,"element":"無"},
            {"name":"デクンダ","name_tw":"迪坤達","desc":"味方全体のステータス弱体化効果を解除する。","mp":5,"point":4,"element":"無"},
            {"name":"バロンダンス","name_tw":"巴隆之舞","desc":"味方全体を回復力95で回復し、３ターンの間、味方全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ増加させる。","mp":7,"point":null,"element":"無"},
            {"name":"天孫降臨","name_tw":"天孫降臨","desc":"６ターンの間、味方全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ増加させる。","mp":8,"point":null,"element":"無"},
            {"name":"雄叫び","name_tw":"吶喊","desc":"３ターンの間、敵全体の攻撃力・防御力をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"溶解ブレス","name_tw":"溶解吐息","desc":"３ターンの間、敵全体の防御力・回避と命中をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"フォッグブレス","name_tw":"迷霧吐息","desc":"３ターンの間、敵全体の攻撃力・回避と命中をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"挑発","name_tw":"挑釁","desc":"３ターンの間、敵全体の攻撃力を20％増加させ、防御力を20％減少させる。","mp":5,"point":8,"element":"無"},
            {"name":"ランダマイザ","name_tw":"女巫詛咒","desc":"３ターンの間、敵全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ減少させる。","mp":8,"point":"15","element":"無"}
        ]
    },
    /*
    {
        name:"無",
        name_tw:"無",
        name_en:"None",
        skills:[
            //毒
            {"name":"ポイズマ","name_tw":"波伊佐瑪","desc":"敵単体を基礎確率40%で毒状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"ポイズマオン","name_tw":"波伊佐瑪翁","desc":"敵単体を基礎確率50%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハポイズマ","name_tw":"瑪哈波伊佐瑪","desc":"敵全体を基礎確率30%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハポイズマオン","name_tw":"瑪哈波伊佐瑪翁","desc":"敵全体を基礎確率30%で毒状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"毒ガスブレス","name_tw":"猛毒吐息","desc":"ランダムな敵を２〜４回、基礎確率30％で毒状態にする。","mp":6,"point":7,"element":"無"},
            //縛
            {"name":"シバブー","name_tw":"希巴縛","desc":"敵単体を基礎確率40%で緊縛状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"シバブオン","name_tw":"希巴縛翁","desc":"敵単体を基礎確率50%で緊縛状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハシバブー","name_tw":"瑪哈希巴縛","desc":"敵全体を基礎確率30%で緊縛状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハシバブオン","name_tw":"瑪哈希巴縛翁","desc":"敵全体を基礎確率40%で緊縛状態にする。","mp":7,"point":null,"element":"無"},
            {"name":"バインドボイス","name_tw":"束縛咆嘯","desc":"ランダムな敵を２～４回、基礎確率30%で緊縛状態にする。","mp":6,"point":null,"element":"無"},
            //魅
            {"name":"マリンカリン","name_tw":"瑪琳卡琳","desc":"敵単体を基礎確率40%で魅了状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"マリンカリオン","name_tw":"瑪琳卡琳翁","desc":"敵単体を基礎確率50%で魅了状態にする。","mp":6,"point":null,"element":"無"},
            {"name":"マハマリンカリン","name_tw":"瑪哈瑪琳卡琳","desc":"敵全体を基礎確率30%で魅了状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハマリカリオン","name_tw":"瑪哈瑪琳卡琳翁","desc":"敵全体を基礎確率40%で魅了状態にする。","mp":7,"point":null,"element":"無"},
            {"name":"セクシーダンス","name_tw":"色誘之舞","desc":"ランダムな敵を２～４回、基礎確率30%で魅了状態にする。","mp":6,"point":7,"element":"無"},
            //封
            {"name":"マカジャマ","name_tw":"瑪卡加瑪","desc":"敵単体を基礎確率40%で魔封状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"マカジャマオン","name_tw":"瑪卡加瑪翁","desc":"敵単体を基礎確率40%で魔封状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハマカジャマ","name_tw":"瑪哈瑪卡加瑪","desc":"敵全体を基礎確率30%で魔封状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハマカジャオン","name_tw":"瑪哈瑪卡加瑪翁","desc":"敵全体を基礎確率40%で魔封状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"ホワイトノイズ","name_tw":"白茫噪音","desc":"ランダムな敵を２～４回、基礎確率30%で魔封状態にする。","mp":6,"point":7,"element":"無"},
            //呪
            {"name":"ジュ","name_tw":"祖","desc":"敵単体を基礎確率50％で呪い状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"ジュオン","name_tw":"祖翁","desc":"敵単体を基礎確率60％で呪い状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハジュ","name_tw":"瑪哈祖","desc":"敵全体を基礎確率40％で呪い状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハジュオン","name_tw":"瑪哈祖翁","desc":"敵全体を基礎確率50％で呪い状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"祟り","name_tw":"報應","desc":"ランダムな敵を１～４回、基礎確率40％で呪い状態にする。","mp":6,"point":7,"element":"無"},
            //虛
            {"name":"デゾレト","name_tw":"特奏累托","desc":"敵単体を基礎確率70％で虚弱状態にする。","mp":5,"point":2,"element":"無"},
            {"name":"デゾレトオン","name_tw":"特奏累托翁","desc":"敵単体を基礎確率80％で虚弱状態にする。","mp":6,"point":8,"element":"無"},
            {"name":"マハデゾレト","name_tw":"瑪哈特奏累托","desc":"敵全体を基礎確率60％で虚弱状態にする。","mp":6,"point":5,"element":"無"},
            {"name":"マハデゾレトオン","name_tw":"瑪哈特奏累托翁","desc":"敵全体を基礎確率70％で虚弱状態にする。","mp":7,"point":9,"element":"無"},
            {"name":"アウトブレイク","name_tw":"威力爆發","desc":"ランダムな敵を１～４回、基礎確率60％で虚弱状態にする。","mp":6,"point":7,"element":"無"},
            //回
            {"name":"ディア","name_tw":"迪亞","desc":"味方単体を回復力50で回復する。","mp":4,"point":1,"element":"無"},
            {"name":"ディアラ","name_tw":"迪亞拉","desc":"味方単体を回復力90で回復する。","mp":5,"point":5,"element":"無"},
            {"name":"ディアラマ","name_tw":"迪亞拉瑪","desc":"味方単体を回復力130で回復する。","mp":6,"point":8,"element":"無"},
            {"name":"ディアラハン","name_tw":"迪亞拉瑪翰","desc":"味方単体を回復力170で回復する。","mp":7,"point":"11","element":"無"},
            {"name":"メディア","name_tw":"梅迪亞","desc":"味方全体を回復力25で回復する。","mp":6,"point":2,"element":"無"},
            {"name":"メディラ","name_tw":"梅迪拉","desc":"味方全体を回復力60で回復する。","mp":7,"point":5,"element":"無"},
            {"name":"メディラマ","name_tw":"梅迪拉瑪","desc":"味方全体を回復力95で回復する。","mp":8,"point":8,"element":"無"},
            {"name":"メディアラハン","name_tw":"梅迪亞拉翰","desc":"味方全体を回復力130で回復する。","mp":9,"point":"11","element":"無"},
            {"name":"メシアライザー","name_tw":"救世主喚起者","desc":"味方全体を回復力95で回復し、状態異常を全て回復する。","mp":"10","point":"15","element":"無"},
            //解毒
            {"name":"ポズムディ","name_tw":"病毒解除術","desc":"味方単体の毒を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メポズムディ","name_tw":"梅波茲姆迪","desc":"味方全体の毒を回復する。","mp":4,"point":5,"element":"無"},
            //解封
            {"name":"クロズディ","name_tw":"克洛茲迪","desc":"味方単体の魔封を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メクロズディ","name_tw":"梅克洛茲迪","desc":"味方全体の魔封を回復する。","mp":4,"point":5,"element":"無"},
            //解縛
            {"name":"パララディ","name_tw":"帕拉拉迪","desc":"味方単体の緊縛を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メパララディ","name_tw":"梅帕拉拉迪","desc":"味方全体の緊縛を回復する。","mp":4,"point":5,"element":"無"},
            //解魅
            {"name":"チャームディ","name_tw":"查姆蒂","desc":"味方単体の魅了を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メチャームディ","name_tw":"梅查姆蒂","desc":"味方全体の魅了を回復する。","mp":4,"point":5,"element":"無"},
            //解呪
            {"name":"カースディ","name_tw":"卡斯迪","desc":"味方単体の呪いを回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メカースディ","name_tw":"梅卡斯迪","desc":"味方全体の呪いを回復する。","mp":4,"point":5,"element":"無"},
            //解虛
            {"name":"ウィークディ","name_tw":"溫坤迪","desc":"味方単体の虚弱を回復する。","mp":3,"point":1,"element":"無"},
            {"name":"メウィークディ","name_tw":"梅溫庫迪","desc":"味方全体の虚弱を回復する。","mp":4,"point":5,"element":"無"},
            //解異常
            {"name":"アムリタ","name_tw":"甘露","desc":"味方単体の状態異常を全て回復する。","mp":4,"point":3,"element":"無"},
            {"name":"常世の祈り","name_tw":"永恆的祈禱","desc":"味方全体の状態異常を全て回復する。","mp":5,"point":8,"element":"無"},
            {"name":"静寂の祈り","name_tw":"寂靜的禱告","desc":"敵味方全体の状態異常を全て回復する。","mp":7,"point":8,"element":"無"},
            //復活
            {"name":"リカーム","name_tw":"利卡姆","desc":"死亡している味方単体をHP10％で復活させる。","mp":6,"point":6,"element":"無"},
            {"name":"サマリカーム","name_tw":"薩瑪利卡姆","desc":"死亡している味方単体を完全回復で復活させる。","mp":8,"point":8,"element":"無"},
            {"name":"リカームドラ","name_tw":"利卡姆托拉","desc":"死亡している味方全体を完全回復で復活させるが、自身は死亡する。","mp":8,"point":"10","element":"無"},
            //強弱化
            {"name":"タルカジャ","name_tw":"塔爾卡加","desc":"３ターンの間、味方全体の攻撃力を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"ラクカジャ","name_tw":"拉庫卡加","desc":"３ターンの間、味方全体の防御力を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"スクカジャ","name_tw":"斯庫卡加","desc":"３ターンの間、味方全体の回避と命中を20％増加させる。","mp":5,"point":6,"element":"無"},
            {"name":"タルンダ","name_tw":"塔倫達","desc":"３ターンの間、敵全体の攻撃力を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"ラクンダ","name_tw":"拉昆達","desc":"３ターンの間、敵全体の防御力を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"スクンダ","name_tw":"斯坤達","desc":"３ターンの間、敵全体の回避と命中を20％減少させる。","mp":5,"point":6,"element":"無"},
            {"name":"デカジャ","name_tw":"迪卡加","desc":"敵全体のステータス強化効果を解除する。","mp":5,"point":4,"element":"無"},
            {"name":"デクンダ","name_tw":"迪坤達","desc":"味方全体のステータス弱体化効果を解除する。","mp":5,"point":4,"element":"無"},
            {"name":"ランダマイザ","name_tw":"女巫詛咒","desc":"３ターンの間、敵全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ減少させる。","mp":8,"point":"15","element":"無"},
            {"name":"雄叫び","name_tw":"吶喊","desc":"３ターンの間、敵全体の攻撃力・防御力をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"溶解ブレス","name_tw":"溶解吐息","desc":"３ターンの間、敵全体の防御力・回避と命中をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"フォッグブレス","name_tw":"迷霧吐息","desc":"３ターンの間、敵全体の攻撃力・回避と命中をそれぞれ20％ずつ減少させる。","mp":6,"point":8,"element":"無"},
            {"name":"挑発","name_tw":"挑釁","desc":"３ターンの間、敵全体の攻撃力を20％増加させ、防御力を20％減少させる。","mp":5,"point":8,"element":"無"},
            //反射
            {"name":"テトラカーン","name_tw":"提特拉康","desc":"１ターンの間、味方全体を打撃型ダメージ反射状態にする。","mp":7,"point":8,"element":"無"},
            {"name":"マカラカーン","name_tw":"瑪卡拉康","desc":"１ターンの間、味方全体を魔法型ダメージ反射状態にする。","mp":7,"point":8,"element":"無"},
            {"name":"テトラコワース","name_tw":"提特拉破壞","desc":"敵全体の打撃型ダメージ反射状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"マカラコワース","name_tw":"瑪卡拉破壞","desc":"敵全体の魔法型ダメージ反射状態を解除する。","mp":3,"point":6,"element":"無"},
            //蓄力
            {"name":"チャージ","name_tw":"蓄力","desc":"自身をチャージ状態にし、次に与える打撃型ダメージを125％増加させる。","mp":6,"point":8,"element":"無"},
            {"name":"コンセントレイト","name_tw":"專注","desc":"自身をコンセントレイト状態にし、次に与える魔法型ダメージを125％増加させる。","mp":6,"point":8,"element":"無"},
            {"name":"リベリオン","name_tw":"反叛","desc":"自身を会心状態にし、次に行う打撃型攻撃を必ずクリティカルにする。","mp":6,"point":8,"element":"無"},
            {"name":"ディスコード","name_tw":"異調相斥","desc":"敵全体のチャージ、コンセントレイト、会心状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"バトンタッチ","name_tw":"下一位","desc":"自身のプレスターンアイコンを消費せずにパスを行う。","mp":3,"point":6,"element":"無"},
            {"name":"バリア","name_tw":"防壁","desc":"３ターンの間、味方単体をバリア状態にし、状態異常を無効にする。","mp":4,"point":8,"element":"無"},
            {"name":"バリアコワース","name_tw":"防壁破壞","desc":"敵全体のバリア状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"リディア","name_tw":"利迪亞","desc":"３回行動するまでの間、味方単体をリディア状態にし、行動する前にHPを回復する。","mp":4,"point":8,"element":"無"},
            {"name":"リディアコワース","name_tw":"利迪亞破壞","desc":"敵全体のリディア状態を解除する。","mp":3,"point":6,"element":"無"},
            {"name":"バロンダンス","name_tw":"巴隆之舞","desc":"味方全体を回復力95で回復し、３ターンの間、味方全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ増加させる。","mp":7,"point":null,"element":"無"},
            //buff
            {"name":"天孫降臨","name_tw":"天孫降臨","desc":"６ターンの間、味方全体の攻撃力・防御力・回避と命中をそれぞれ20％ずつ増加させる。","mp":8,"point":null,"element":"無"}
        ]
    },
    */
    {
        name:"属性",
        name_tw:"屬性",
        name_en:"",
        skills:[
            //強化
            {"name":"物理ブースタ","name_tw":"物理強化","desc":"物理属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"物理ハイブースタ","name_tw":"高級物理強化","desc":"物理属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"火炎ブースタ","name_tw":"火炎強化","desc":"火炎属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"火炎ハイブースタ","name_tw":"高級火炎強化","desc":"火炎属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"氷結ブースタ","name_tw":"冰凍強化","desc":"氷結属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"氷結ハイブースタ","name_tw":"高級冰凍強化","desc":"氷結属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"電撃ブースタ","name_tw":"電擊強化","desc":"電撃属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"電撃ハイブースタ","name_tw":"高級電擊強化","desc":"電撃属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"衝撃ブースタ","name_tw":"衝擊強化","desc":"衝撃属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"衝撃ハイブースタ","name_tw":"高級衝擊強化","desc":"衝撃属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"破魔ブースタ","name_tw":"破魔強化","desc":"破魔属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"破魔ハイブースタ","name_tw":"高級破魔強化","desc":"破魔属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"呪殺ブースタ","name_tw":"咒殺強化","desc":"呪殺属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"呪殺ハイブースタ","name_tw":"高級咒殺強化","desc":"呪殺属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"回復ブースタ","name_tw":"回復強化","desc":"回復スキルの回復量が15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"回復ハイブースタ","name_tw":"高級回復強化","desc":"回復スキルの回復量が25％増加する。","mp":null,"point":"21","element":"パシップ"},
            //貫通
            {"name":"物理貫通","name_tw":"物理貫通","desc":"物理貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"火炎貫通","name_tw":"火炎貫通","desc":"火炎貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"電撃貫通","name_tw":"電擊貫通","desc":"電撃貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"衝撃貫通","name_tw":"衝擊貫通","desc":"衝撃貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            //耐性
            {"name":"物理耐性","name_tw":"物理耐性","desc":"物理耐性を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"火炎耐性","name_tw":"火炎耐性","desc":"火炎耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"氷結耐性","name_tw":"冰凍耐性","desc":"氷結耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"電撃耐性","name_tw":"電擊耐性","desc":"電撃耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"衝撃耐性","name_tw":"衝擊耐性","desc":"衝撃耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"破魔耐性","name_tw":"破魔耐性","desc":"破魔耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"呪殺耐性","name_tw":"咒殺耐性","desc":"呪殺耐性を得る。","mp":null,"point":8,"element":"パシップ"},

            {"name":"物理無効","name_tw":"物理無效","desc":"物理無効を得る。","mp":null,"point":"18","element":"パシップ"},
            {"name":"火炎無効","name_tw":"火炎無效","desc":"火炎無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"氷結無効","name_tw":"冰凍無效","desc":"氷結無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"電撃無効","name_tw":"電擊無效","desc":"電撃無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"衝撃無効","name_tw":"衝擊無效","desc":"衝撃無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"破魔無効","name_tw":"破魔無效","desc":"破魔無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"呪殺無効","name_tw":"咒殺無效","desc":"呪殺無効を得る。","mp":null,"point":"12","element":"パシップ"},

            {"name":"火炎反射","name_tw":"火炎反射","desc":"火炎反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"氷結反射","name_tw":"冰凍反射","desc":"氷結反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"電撃反射","name_tw":"電擊反射","desc":"電撃反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"衝撃反射","name_tw":"衝擊反射","desc":"衝撃反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"破魔反射","name_tw":"破魔反射","desc":"破魔反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"呪殺反射","name_tw":"咒殺反射","desc":"呪殺反射を得る。","mp":null,"point":"16","element":"パシップ"},

            {"name":"物理吸収","name_tw":"物理吸收","desc":"物理吸収を得る。","mp":null,"point":"30","element":"パシップ"},
            {"name":"火炎吸収","name_tw":"火炎吸收","desc":"火炎吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"氷結吸収","name_tw":"冰凍吸收","desc":"氷結吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"電撃吸収","name_tw":"電擊吸收","desc":"電撃吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"破魔吸収","name_tw":"破魔吸收","desc":"破魔吸収を得る。","mp":null,"point":"20","element":"パシップ"},

            {"name":"毒耐性","name_tw":"毒耐性","desc":"毒になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"緊縛耐性","name_tw":"束縛耐性","desc":"緊縛になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"魅了耐性","name_tw":"魅惑耐性","desc":"魅了になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"魔封耐性","name_tw":"魔封耐性","desc":"魔封になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"呪い耐性","name_tw":"詛咒耐性","desc":"呪いになる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"虚弱耐性","name_tw":"虛弱耐性","desc":"虚弱になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},

            {"name":"毒無効","name_tw":"毒無效","desc":"毒無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"緊縛無効","name_tw":"束縛無效","desc":"緊縛無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"魅了無効","name_tw":"魅惑無效","desc":"魅了無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"魔封無効","name_tw":"魔封無效","desc":"魔封無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"呪い無効","name_tw":"詛咒無效","desc":"呪い無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"虚弱無効","name_tw":"虛弱無效","desc":"虚弱無効を得る。","mp":null,"point":"12","element":"パシップ"}
        ]
    },
    {
        name:"能力",
        name_tw:"能力",
        name_en:"",
        skills:[
            //速度
            {"name":"スピードスター","name_tw":"急速之星","desc":"悪魔のバトルスピードへの影響が50％増加する。","mp":null,"point":"10","element":"パシップ"},
            //命中
            {"name":"百発百中","name_tw":"百發百中","desc":"物理命中率が10％増加する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"千発千中","name_tw":"千發千中","desc":"物理命中率が20％増加する。","mp":null,"point":"16","element":"パシップ"},
            
            //迴避
            {"name":"見切り","name_tw":"識破","desc":"物理回避率が10％増加する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"寸分の見切り","name_tw":"分寸識破","desc":"物理回避率が20％増加する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"ヴァーハナ","name_tw":"神馭騎獸","desc":"物理回避率15%増加。状態異常になる確率を30%減少。","mp":null,"point":null,"element":"パシップ"},
            {"name":"ステルス","name_tw":"隱密","desc":"物理回避率が20％増加する。さらに、この悪魔が死亡するとき、一度だけHP1で踏みとどまる。","mp":null,"point":null,"element":"パシップ"},
            //異命
            {"name":"乱れ狂い","name_tw":"凌亂綻放","desc":"状態異常にする確率が10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"狂い咲き","name_tw":"狂亂綻放","desc":"状態異常にする確率が20％増加する。","mp":null,"point":"24","element":"パシップ"},
            //狀防
            {"name":"地獄のマスク","name_tw":"地域口罩","desc":"状態異常になる確率が35％減少する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"奈落のマスク","name_tw":"奈落口罩","desc":"状態異常になる確率が60％減少する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"マレビト","name_tw":"稀人","desc":"全ての状態異常にかからなくなる。","mp":null,"point":null,"element":"パシップ"},
            //狀回
            {"name":"自然治癒","name_tw":"自然痊癒","desc":"状態異常の自然回復率が20％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"超自然治癒","name_tw":"超自然痊癒","desc":"状態異常の自然回復率が30％増加する。","mp":null,"point":"16","element":"パシップ"},
            //會增
            {"name":"コロシの愉悦","name_tw":"殺戮的愉悅","desc":"クリティカル率が15％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"ミナゴロシの愉悦","name_tw":"趕盡殺絕的愉悅","desc":"クリティカル率が25％増加する。","mp":null,"point":"14","element":"パシップ"},
            //會減
            {"name":"野生の勘","name_tw":"野生直覺","desc":"自身が受ける攻撃のクリティカル率を15％減少させる。","mp":null,"point":8,"element":"パシップ"},
            {"name":"野獣の勘","name_tw":"野獸直覺","desc":"自身が受ける攻撃のクリティカル率を25％減少させる。","mp":null,"point":"14","element":"パシップ"},
            //
            {"name":"一分の活泉","name_tw":"一分之活泉","desc":"最大HPが10％増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"二分の活泉","name_tw":"二分之活泉","desc":"最大HPが20％増加する。","mp":null,"point":7,"element":"パシップ"},
            {"name":"三分の活泉","name_tw":"三分之活泉","desc":"最大HPが30％増加する。","mp":null,"point":"15","element":"パシップ"},
            {"name":"一分の魔脈","name_tw":"一分之魔脈","desc":"最大MPが１増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"二分の魔脈","name_tw":"二分之魔脈","desc":"最大MPが２増加する。","mp":null,"point":"15","element":"パシップ"},
            {"name":"初段の剛力","name_tw":"初段之剛力","desc":"力が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の賢魔","name_tw":"初段之賢魔","desc":"魔が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の恵体","name_tw":"初段之惠體","desc":"体が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の猛速","name_tw":"初段之猛速","desc":"速が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の強運","name_tw":"初段之強運","desc":"運が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"二段の剛力","name_tw":"二段之剛力","desc":"力が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の賢魔","name_tw":"二段之賢魔","desc":"魔が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の恵体","name_tw":"二段之惠體","desc":"体が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の猛速","name_tw":"二段之猛速","desc":"速が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の強運","name_tw":"二段之強運","desc":"運が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"三段の剛力","name_tw":"二段之剛力","desc":"力が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の賢魔","name_tw":"三段之賢魔","desc":"魔が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の恵体","name_tw":"三段之惠體","desc":"体が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の猛速","name_tw":"三段之猛速","desc":"速が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の強運","name_tw":"三段之強運","desc":"運が15増加する。","mp":null,"point":"32","element":"パシップ"}
        ]
    },
    {
        name:"追擊",
        name_tw:"追擊",
        name_en:"",
        skills:[
            {"name":"暗殺者","name_tw":"暗殺者","desc":"単体攻撃スキルで与えるダメージが10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"虐殺者","name_tw":"虐殺者","desc":"全体攻撃スキルで与えるダメージが10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"大虐殺者","name_tw":"大虐殺者","desc":"全体攻撃スキルで与えるダメージが20％増加する。","mp":null,"point":"24","element":"パシップ"},
            {"name":"毒追撃","name_tw":"毒追擊","desc":"敵が毒状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"緊縛追撃","name_tw":"束縛追擊","desc":"敵が緊縛状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"魅了追撃","name_tw":"魅惑追擊","desc":"敵が魅了状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"魔封追撃","name_tw":"魔封追擊","desc":"敵が魔封状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"狂戦士","name_tw":"狂戰士","desc":"敵に与えるダメージが10％増加し、自身が受けるダメージも20％増加する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"追い打ち","name_tw":"追擊","desc":"敵の弱点をついたとき、ダメージが10％増加する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"無慈悲な一撃","name_tw":"無情的一擊","desc":"敵の弱点をついたとき、ダメージが20％増加する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"武道の素養","name_tw":"武道的素養","desc":"物理属性で与えるダメージが15％増加し、物理命中率も15％増加する。","mp":null,"point":null,"element":"パシップ"}
        ]
    },
    {
        name:"オート",
        name_tw:"自動",
        name_en:"",
        skills:[
            //反擊
            {"name":"反撃","name_tw":"反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力50で与える。","mp":null,"point":6,"element":"パシップ"},
            {"name":"猛反撃","name_tw":"兇猛反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力100で与える。","mp":null,"point":"12","element":"パシップ"},
            {"name":"デスカウンター","name_tw":"死亡反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力150で与える。","mp":null,"point":"18","element":"パシップ"},
            //防死
            {"name":"食いしばり","name_tw":"強忍","desc":"この悪魔が死亡するとき、一度だけHP1で踏みとどまる。","mp":null,"point":6,"element":"パシップ"},
            {"name":"不屈の闘志","name_tw":"不屈的鬥志","desc":"この悪魔が死亡するとき、一度だけHPが200回復する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"アヴァターラ","name_tw":"降世化身","desc":"この悪魔が死亡するとき、一度だけHP1で踏みとどまる。ウェーブをまたぐとき、HPが10％回復する。","mp":null,"point":null,"element":"パシップ"},
            //自回
            {"name":"勝利の息吹","name_tw":"勝利的氣息","desc":"ウェーブをまたぐとき、HPが30％回復する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"勝利のチャクラ","name_tw":"勝利的查克拉","desc":"ウェーブをまたぐとき、MPが10回復する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"無限のチャクラ","name_tw":"無限的查克拉","desc":"MPの自然回復量が１増加する。","mp":null,"point":"18","element":"パシップ"},
            //反射
            {"name":"テトラカシフト","name_tw":"提特拉康脈動","desc":"後攻でバトルを開始したとき、テトラカーンが発動する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"マカラカシフト","name_tw":"瑪卡拉康脈動","desc":"後攻でバトルを開始したとき、マカラカーンが発動する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"貫反の霊圧","name_tw":"貫反靈壓","desc":"","mp":null,"point":null,"element":"パシップ"},
            //增強
            {"name":"タルカオート","name_tw":"自動塔爾卡","desc":"１ターン目開始時、タルカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"ラクカオート","name_tw":"自動拉庫卡","desc":"１ターン目開始時、ラクカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"スクカオート","name_tw":"自動斯庫卡","desc":"１ターン目開始時、スクカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"タルンダオート","name_tw":"自動塔倫達","desc":"１ターン目開始時、タルンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"ラクンダオート","name_tw":"自動拉昆達","desc":"１ターン目開始時、ラクンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"スクンダオート","name_tw":"自動斯坤達","desc":"１ターン目開始時、スクンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            //壓制
            {"name":"威圧の構え","name_tw":"威攝姿態","desc":"後攻でバトルを開始したとき、敵のプレスターンアイコンを１つ減少させる。","mp":null,"point":"21","element":"パシップ"},
            //節省
            {"name":"トリックスター","name_tw":"狡計之星","desc":"敵の弱点をついたとき、20％の確率でプレスターンアイコンを消費しない。","mp":null,"point":null,"element":"パシップ"},
            {"name":"月の加護","name_tw":"月之庇佑","desc":"MPを消費するとき、消費するMPが１減少する。","mp":null,"point":null,"element":"パシップ"}
        ]
    },
    {
        name:"特殊",
        name_tw:"特殊",
        name_en:"",
        skills:[
            {"name":"コウウン","name_tw":"幸運","desc":"D×2とパーティ悪魔がバトルで獲得する経験値を20％、バトルで獲得するマッカを20％増加させる。","mp":null,"point":null,"element":"パシップ"},
            {"name":"毒床歩き","name_tw":"漫步雷池","desc":"アウラゲート内のダメージ床のダメージが25％減少する。","mp":null,"point":2,"element":"パシップ"},
            {"name":"毒床渡り","name_tw":"闊步雷池","desc":"アウラゲート内のダメージ床のダメージが50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"ワナフーリ","name_tw":"陷阱弱化","desc":"アウラゲート内でダメージ床のダメージが30％減少し、ダークゾーンの効果を無効にする。","mp":null,"point":null,"element":"パシップ"},
            {"name":"毒床無効","name_tw":"雷池無懼","desc":"アウラゲート内のダメージ床のダメージを無効にする。","mp":null,"point":8,"element":"パシップ"},
            {"name":"ダークゾーン無効","name_tw":"黑暗區域無效","desc":"アウラゲート内のダークゾーンの効果を無効にする。","mp":null,"point":8,"element":"パシップ"}
        ]
    },
    /*
    {
        name:"パシップ",
        name_tw:"被動",
        name_en:"Passive",
        skills:[
            {"name":"トリックスター","name_tw":"狡計之星","desc":"敵の弱点をついたとき、20％の確率でプレスターンアイコンを消費しない。","mp":null,"point":null,"element":"パシップ"},
            {"name":"月の加護","name_tw":"月之庇佑","desc":"MPを消費するとき、消費するMPが１減少する。","mp":null,"point":null,"element":"パシップ"},
            {"name":"ステルス","name_tw":"隱密","desc":"物理回避率が20％増加する。さらに、この悪魔が死亡するとき、一度だけHP1で踏みとどまる。","mp":null,"point":null,"element":"パシップ"},
            {"name":"コウウン","name_tw":"幸運","desc":"D×2とパーティ悪魔がバトルで獲得する経験値を20％、バトルで獲得するマッカを20％増加させる。","mp":null,"point":null,"element":"パシップ"},
            {"name":"ワナフーリ","name_tw":"陷阱弱化","desc":"アウラゲート内でダメージ床のダメージが30％減少し、ダークゾーンの効果を無効にする。","mp":null,"point":null,"element":"パシップ"},
            {"name":"マレビト","name_tw":"稀人","desc":"全ての状態異常にかからなくなる。","mp":null,"point":null,"element":"パシップ"},
            {"name":"武道の素養","name_tw":"武道的素養","desc":"物理属性で与えるダメージが15％増加し、物理命中率も15％増加する。","mp":null,"point":null,"element":"パシップ"},
            {"name":"アヴァターラ","name_tw":"降世化身","desc":"この悪魔が死亡するとき、一度だけHP1で踏みとどまる。ウェーブをまたぐとき、HPが10％回復する。","mp":null,"point":null,"element":"パシップ"},
            //耐性
            {"name":"物理耐性","name_tw":"物理耐性","desc":"物理耐性を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"火炎耐性","name_tw":"火炎耐性","desc":"火炎耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"氷結耐性","name_tw":"冰凍耐性","desc":"氷結耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"電撃耐性","name_tw":"電擊耐性","desc":"電撃耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"衝撃耐性","name_tw":"衝擊耐性","desc":"衝撃耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"破魔耐性","name_tw":"破魔耐性","desc":"破魔耐性を得る。","mp":null,"point":8,"element":"パシップ"},
            {"name":"呪殺耐性","name_tw":"咒殺耐性","desc":"呪殺耐性を得る。","mp":null,"point":8,"element":"パシップ"},

            {"name":"物理無効","name_tw":"物理無效","desc":"物理無効を得る。","mp":null,"point":"18","element":"パシップ"},
            {"name":"火炎無効","name_tw":"火炎無效","desc":"火炎無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"氷結無効","name_tw":"冰凍無效","desc":"氷結無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"電撃無効","name_tw":"電擊無效","desc":"電撃無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"衝撃無効","name_tw":"衝擊無效","desc":"衝撃無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"破魔無効","name_tw":"破魔無效","desc":"破魔無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"呪殺無効","name_tw":"咒殺無效","desc":"呪殺無効を得る。","mp":null,"point":"12","element":"パシップ"},

            {"name":"火炎反射","name_tw":"火炎反射","desc":"火炎反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"氷結反射","name_tw":"冰凍反射","desc":"氷結反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"電撃反射","name_tw":"電擊反射","desc":"電撃反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"衝撃反射","name_tw":"衝擊反射","desc":"衝撃反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"破魔反射","name_tw":"破魔反射","desc":"破魔反射を得る。","mp":null,"point":"16","element":"パシップ"},
            {"name":"呪殺反射","name_tw":"咒殺反射","desc":"呪殺反射を得る。","mp":null,"point":"16","element":"パシップ"},

            {"name":"物理吸収","name_tw":"物理吸收","desc":"物理吸収を得る。","mp":null,"point":"30","element":"パシップ"},
            {"name":"火炎吸収","name_tw":"火炎吸收","desc":"火炎吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"氷結吸収","name_tw":"冰凍吸收","desc":"氷結吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"電撃吸収","name_tw":"電擊吸收","desc":"電撃吸収を得る。","mp":null,"point":"20","element":"パシップ"},
            {"name":"破魔吸収","name_tw":"破魔吸收","desc":"破魔吸収を得る。","mp":null,"point":"20","element":"パシップ"},

            {"name":"毒耐性","name_tw":"毒耐性","desc":"毒になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"緊縛耐性","name_tw":"束縛耐性","desc":"緊縛になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"魅了耐性","name_tw":"魅惑耐性","desc":"魅了になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"魔封耐性","name_tw":"魔封耐性","desc":"魔封になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"呪い耐性","name_tw":"詛咒耐性","desc":"呪いになる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"虚弱耐性","name_tw":"虛弱耐性","desc":"虚弱になる確率が50％減少する。","mp":null,"point":4,"element":"パシップ"},

            {"name":"毒無効","name_tw":"毒無效","desc":"毒無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"緊縛無効","name_tw":"束縛無效","desc":"緊縛無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"魅了無効","name_tw":"魅惑無效","desc":"魅了無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"魔封無効","name_tw":"魔封無效","desc":"魔封無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"呪い無効","name_tw":"詛咒無效","desc":"呪い無効を得る。","mp":null,"point":"12","element":"パシップ"},
            {"name":"虚弱無効","name_tw":"虛弱無效","desc":"虚弱無効を得る。","mp":null,"point":"12","element":"パシップ"},
                        
            {"name":"物理貫通","name_tw":"物理貫通","desc":"物理貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"火炎貫通","name_tw":"火炎貫通","desc":"火炎貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"電撃貫通","name_tw":"電擊貫通","desc":"電撃貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            {"name":"衝撃貫通","name_tw":"衝擊貫通","desc":"衝撃貫通を得る。","mp":null,"point":"32","element":"パシップ"},
            
            {"name":"物理ブースタ","name_tw":"物理強化","desc":"物理属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"物理ハイブースタ","name_tw":"高級物理強化","desc":"物理属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"火炎ブースタ","name_tw":"火炎強化","desc":"火炎属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"火炎ハイブースタ","name_tw":"高級火炎強化","desc":"火炎属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"氷結ブースタ","name_tw":"冰凍強化","desc":"氷結属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"氷結ハイブースタ","name_tw":"高級冰凍強化","desc":"氷結属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"電撃ブースタ","name_tw":"電擊強化","desc":"電撃属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"電撃ハイブースタ","name_tw":"高級電擊強化","desc":"電撃属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"衝撃ブースタ","name_tw":"衝擊強化","desc":"衝撃属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"衝撃ハイブースタ","name_tw":"高級衝擊強化","desc":"衝撃属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"破魔ブースタ","name_tw":"破魔強化","desc":"破魔属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"破魔ハイブースタ","name_tw":"高級破魔強化","desc":"破魔属性で与えるダメージが25％増加する。","mp":null,"point":21,"element":"パシップ"},
            {"name":"呪殺ブースタ","name_tw":"咒殺強化","desc":"呪殺属性で与えるダメージが15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"呪殺ハイブースタ","name_tw":"高級咒殺強化","desc":"呪殺属性で与えるダメージが25％増加する。","mp":null,"point":"21","element":"パシップ"},
            {"name":"回復ブースタ","name_tw":"回復強化","desc":"回復スキルの回復量が15％増加する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"回復ハイブースタ","name_tw":"高級回復強化","desc":"回復スキルの回復量が25％増加する。","mp":null,"point":"21","element":"パシップ"},
            
            {"name":"暗殺者","name_tw":"暗殺者","desc":"単体攻撃スキルで与えるダメージが10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"虐殺者","name_tw":"虐殺者","desc":"全体攻撃スキルで与えるダメージが10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"大虐殺者","name_tw":"大虐殺者","desc":"全体攻撃スキルで与えるダメージが20％増加する。","mp":null,"point":"24","element":"パシップ"},
            {"name":"毒追撃","name_tw":"毒追擊","desc":"敵が毒状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"緊縛追撃","name_tw":"束縛追擊","desc":"敵が緊縛状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"魅了追撃","name_tw":"魅惑追擊","desc":"敵が魅了状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"魔封追撃","name_tw":"魔封追擊","desc":"敵が魔封状態のときに与えるダメージが30％増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"狂戦士","name_tw":"狂戰士","desc":"敵に与えるダメージが10％増加し、自身が受けるダメージも20％増加する。","mp":null,"point":"18","element":"パシップ"},
            //能力強化
            {"name":"初段の剛力","name_tw":"初段之剛力","desc":"力が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の賢魔","name_tw":"初段之賢魔","desc":"魔が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の恵体","name_tw":"初段之惠體","desc":"体が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の猛速","name_tw":"初段之猛速","desc":"速が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"初段の強運","name_tw":"初段之強運","desc":"運が５増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"二段の剛力","name_tw":"二段之剛力","desc":"力が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の賢魔","name_tw":"二段之賢魔","desc":"魔が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の恵体","name_tw":"二段之惠體","desc":"体が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の猛速","name_tw":"二段之猛速","desc":"速が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"二段の強運","name_tw":"二段之強運","desc":"運が10増加する。","mp":null,"point":13,"element":"パシップ"},
            {"name":"三段の剛力","name_tw":"二段之剛力","desc":"力が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の賢魔","name_tw":"三段之賢魔","desc":"魔が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の恵体","name_tw":"三段之惠體","desc":"体が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の猛速","name_tw":"三段之猛速","desc":"速が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"三段の強運","name_tw":"三段之強運","desc":"運が15増加する。","mp":null,"point":"32","element":"パシップ"},
            {"name":"ヴァーハナ","name_tw":"神馭騎獸","desc":"物理回避率15%増加。状態異常になる確率を30%減少。","mp":null,"point":null,"element":"パシップ"},
            {"name":"百発百中","name_tw":"百發百中","desc":"物理命中率が10％増加する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"千発千中","name_tw":"千發千中","desc":"物理命中率が20％増加する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"見切り","name_tw":"識破","desc":"物理回避率が10％増加する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"寸分の見切り","name_tw":"分寸識破","desc":"物理回避率が20％増加する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"乱れ狂い","name_tw":"凌亂綻放","desc":"状態異常にする確率が10％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"狂い咲き","name_tw":"狂亂綻放","desc":"状態異常にする確率が20％増加する。","mp":null,"point":"24","element":"パシップ"},
            {"name":"地獄のマスク","name_tw":"地域口罩","desc":"状態異常になる確率が35％減少する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"奈落のマスク","name_tw":"奈落口罩","desc":"状態異常になる確率が60％減少する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"自然治癒","name_tw":"自然痊癒","desc":"状態異常の自然回復率が20％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"超自然治癒","name_tw":"超自然痊癒","desc":"状態異常の自然回復率が30％増加する。","mp":null,"point":"16","element":"パシップ"},
            {"name":"コロシの愉悦","name_tw":"殺戮的愉悅","desc":"クリティカル率が15％増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"ミナゴロシの愉悦","name_tw":"趕盡殺絕的愉悅","desc":"クリティカル率が25％増加する。","mp":null,"point":"14","element":"パシップ"},
            {"name":"野生の勘","name_tw":"野生直覺","desc":"自身が受ける攻撃のクリティカル率を15％減少させる。","mp":null,"point":8,"element":"パシップ"},
            {"name":"野獣の勘","name_tw":"野獸直覺","desc":"自身が受ける攻撃のクリティカル率を25％減少させる。","mp":null,"point":"14","element":"パシップ"},
            {"name":"一分の活泉","name_tw":"一分之活泉","desc":"最大HPが10％増加する。","mp":null,"point":3,"element":"パシップ"},
            {"name":"二分の活泉","name_tw":"二分之活泉","desc":"最大HPが20％増加する。","mp":null,"point":7,"element":"パシップ"},
            {"name":"三分の活泉","name_tw":"三分之活泉","desc":"最大HPが30％増加する。","mp":null,"point":"15","element":"パシップ"},
            {"name":"一分の魔脈","name_tw":"一分之魔脈","desc":"最大MPが１増加する。","mp":null,"point":8,"element":"パシップ"},
            {"name":"二分の魔脈","name_tw":"二分之魔脈","desc":"最大MPが２増加する。","mp":null,"point":"15","element":"パシップ"},
            //被動
            {"name":"反撃","name_tw":"反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力50で与える。","mp":null,"point":6,"element":"パシップ"},
            {"name":"猛反撃","name_tw":"兇猛反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力100で与える。","mp":null,"point":"12","element":"パシップ"},
            {"name":"デスカウンター","name_tw":"死亡反擊","desc":"敵の打撃型攻撃を受けたとき、50％の確率で物理属性の打撃型ダメージを威力150で与える。","mp":null,"point":"18","element":"パシップ"},
            {"name":"食いしばり","name_tw":"強忍","desc":"この悪魔が死亡するとき、一度だけHP1で踏みとどまる。","mp":null,"point":6,"element":"パシップ"},
            {"name":"不屈の闘志","name_tw":"不屈的鬥志","desc":"この悪魔が死亡するとき、一度だけHPが200回復する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"勝利の息吹","name_tw":"勝利的氣息","desc":"ウェーブをまたぐとき、HPが30％回復する。","mp":null,"point":6,"element":"パシップ"},
            {"name":"勝利のチャクラ","name_tw":"勝利的查克拉","desc":"ウェーブをまたぐとき、MPが10回復する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"無限のチャクラ","name_tw":"無限的查克拉","desc":"MPの自然回復量が１増加する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"テトラカシフト","name_tw":"提特拉康脈動","desc":"後攻でバトルを開始したとき、テトラカーンが発動する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"マカラカシフト","name_tw":"瑪卡拉康脈動","desc":"後攻でバトルを開始したとき、マカラカーンが発動する。","mp":null,"point":"18","element":"パシップ"},
            {"name":"タルカオート","name_tw":"自動塔爾卡","desc":"１ターン目開始時、タルカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"ラクカオート","name_tw":"自動拉庫卡","desc":"１ターン目開始時、ラクカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"スクカオート","name_tw":"自動斯庫卡","desc":"１ターン目開始時、スクカジャが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"タルンダオート","name_tw":"自動塔倫達","desc":"１ターン目開始時、タルンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"ラクンダオート","name_tw":"自動拉昆達","desc":"１ターン目開始時、ラクンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"スクンダオート","name_tw":"自動斯坤達","desc":"１ターン目開始時、スクンダが発動する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"威圧の構え","name_tw":"威攝姿態","desc":"後攻でバトルを開始したとき、敵のプレスターンアイコンを１つ減少させる。","mp":null,"point":"21","element":"パシップ"},
            {"name":"スピードスター","name_tw":"急速之星","desc":"悪魔のバトルスピードへの影響が50％増加する。","mp":null,"point":"10","element":"パシップ"},
            {"name":"追い打ち","name_tw":"追擊","desc":"敵の弱点をついたとき、ダメージが10％増加する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"無慈悲な一撃","name_tw":"無情的一擊","desc":"敵の弱点をついたとき、ダメージが20％増加する。","mp":null,"point":"12","element":"パシップ"},
            {"name":"毒床歩き","name_tw":"漫步雷池","desc":"アウラゲート内のダメージ床のダメージが25％減少する。","mp":null,"point":2,"element":"パシップ"},
            {"name":"毒床渡り","name_tw":"闊步雷池","desc":"アウラゲート内のダメージ床のダメージが50％減少する。","mp":null,"point":4,"element":"パシップ"},
            {"name":"毒床無効","name_tw":"雷池無懼","desc":"アウラゲート内のダメージ床のダメージを無効にする。","mp":null,"point":8,"element":"パシップ"},
            {"name":"ダークゾーン無効","name_tw":"黑暗區域無效","desc":"アウラゲート内のダークゾーンの効果を無効にする。","mp":null,"point":8,"element":"パシップ"},
            {"name":"貫反の霊圧","name_tw":"貫反靈壓","desc":"","mp":null,"point":null,"element":"パシップ"}
        ]
    }*/
];


//////////////////////
// i18n
//////////////////////

const messages = {
    en: {
      message: {
        fusion: 'Fusion',
        skill:'Skill',
        reverse:'Reverse',
        normal:'Normal',
        reverse_fusion: 'Reverse Fusion',
        normal_fusion: 'Normal Fusion',
        devil: 'Devil',
        setting:'Setting',
        language: 'Language',
        downgrade_fusion: 'Downgrade Fusion',
        prevent_unload:'Prevent Unload',
        allow: 'Allow',
        deny: 'Deny',
        search:'Search',
        element:'Element',
        inherit:'Inherit',
        description:'Description'
      }
    },
    ja: {
      message: {
        fusion:'合体',
        skill:'スキル',
        reverse:'逆引き',
        normal:'通常',
        reverse_fusion: '逆引き合体',
        normal_fusion: '通常合体',
        devil: '仲魔',
        setting:'環境',
        language: '言語',
        downgrade_fusion: 'ダウングレイド合体',
        prevent_unload:'アンロードを防止する',
        allow: '許可する',
        deny: '許可しない',
        search:'探す',
        element:'属性',
        inherit:'継承',
        description:'説明'
      }
    },
    tw: {
        message:{
            fusion:'合體',
            skill:'技能',
            reverse:'逆向',
            normal:'順向',
            reverse_fusion: '逆向合體',
            normal_fusion: '順向合體',
            devil: '惡魔',
            setting:'設定',
            language: '語言',
            downgrade_fusion: '降階合體',
            prevent_unload:'防止換頁',
            allow:'允許',
            deny:'不允許',
            search:'查詢',
            element:'屬性',
            inherit:'繼承',
            description:'說明'
        }
    }
};


//////////////////////
// Devil Class
//////////////////////

var Devil = function(devil){
    
    this.name = devil.name;
    this.name_tw = devil.name_tw;
    this.name_en = devil.name_en;
    this.rarity = devil.rarity;
    this.grade = devil.grade;
    this.icon = devil.icon;
    this.elements = devil.elements;
    this.skills = devil.skills;
    this.skill4 = devil.skill4;
    this.skill5 = devil.skill5;
    this.type = devil.type;
    this.max = null;
    this.min = null;
    this.race = null;
    this.fission_options = [];
    this.fusion_options = [];
    this.cost = null;
};

Devil.prototype.showName = function(){
    
    var name;
            
    switch(i18n.locale){
        case 'ja': name = this.name; break;
        case 'tw': name = this.name_tw; break;
        case 'en': name = this.name_en; break;
        default: name = this.name;
    }
    if(!name)
        name = this.name;

    return name;
}

Devil.prototype.showGrade = function(){
    
    return 'G.'+this.grade;
}

Devil.prototype.showRarity = function(){

    var rarity = "";
    for(var i=0; i<this.rarity;i++)
        rarity += '★';
    return rarity;
}

Devil.prototype.fission_formulas = function(){
    
    var devil = this;
    
    var formulas = [];
  
    this.race.formulas.forEach(function(f){

        var r1 = f[0];
        var r2 = f[1];

        var boms = [];

        r1.devils.forEach(function(d1){
            r2.devils.forEach(function(d2){

                var bom = DevilBom.bom(devil,d1,d2);

                if(bom)
                    boms.push(bom);
            });
        });

        boms.sort(function(bom1,bom2){
            return bom1.order - bom2.order;
        });

        if(boms.length>0){
            formulas.push({
                'name': r1.name + ' x ' + r2.name,
                'boms':boms
            });
        }

    });

    return formulas;
}

Devil.prototype.fusion_formulas = function(){

    var d1 = this;
    var multi_formulas = [];

    // Target Race Loop
    this.race.usage.forEach(function(u){

        // Target Devil Loop
        u.target.devils.forEach(function(target){

            var formulas = [];
           
            u.r2s.forEach(function(r2){

                var boms = [];

                // Pair Devil Loop
                r2.devils.forEach(function(d2){

                    var bom = DevilBom.bom(target, d1, d2);

                    if(bom)
                        boms.push(bom)
                });

                boms.sort(function(c1,c2){
                    return c1.order - c2.order;
                });

                if(boms.length>0){

                    formulas.push({
                        'name': d1.race.name + ' x ' + r2.name,
                        'boms': boms
                    });
                }
            });
            
            if(formulas.length>0){
                multi_formulas.push({
                    devil:target,
                    formulas:formulas
                });
            }
        });

    });

    return multi_formulas;
}

////////////////////
// Race Class
///////////////////

var Race = function(race){
    
    this.name = race.name;
    this.formulas = race.formulas;
    this.devils = race.devils;
}

Race.prototype.showName = function(){

    var name;
            
    switch(i18n.locale){
        case 'ja': name = this.name; break;
        case 'tw': name = this.name_tw; break;
        case 'en': name = this.name_en; break;
        default: name = this.name;
    }

    return name ? name : this.name;
}

////////////////////
// Skill Class
////////////////////

var Skill = function(skill){

    this.name = skill.name;
    this.name_tw = skill.name_tw==null ? "" : skill.name_tw;
    this.name_en = "";
    this.desc = skill.desc==null ? "" : skill.desc;
    this.desc_tw = skill.desc_tw==null ? "" : skill.desc_tw;
    this.mp = skill.mp==null ? "" : skill.mp;
    this.point = skill.point == null ? "" : skill.point;
    this.element = skill.element == null ? "" : skill.element;
    this.type = null;
    this.devils = [];
}
Skill.prototype.showName = function(){
    
    switch(i18n.locale){
        case 'ja': name = this.name; break;
        case 'tw': name = this.name_tw; break;
        case 'en': name = this.name_en; break;
        default: name = this.name;
    }
    if(!name)
        name = this.name;
    if(!name)
        name = '--------------------';
    return name;
}
Skill.prototype.showDesc = function(){
   
    switch(i18n.locale){
        case 'ja': desc = this.desc; break;
        case 'tw': desc = this.desc_tw; break;
        case 'en': desc = this.desc_en; break;
        default: desc = this.desc;
    }
    if(!desc)
        desc = this.desc;
    if(!desc)
        desc = '';
   
    return desc;
}
Skill.prototype.showHint = function(){

    var hint = '屬性: '+this.element+' MP: '+this.mp+' 繼承: '+this.point+'\n'+this.showDesc();
    return hint;
}
Skill.prototype.addDevil = function(new_devil){
    
    var devils = this.devils.filter(function(devil){
        return devil.name == new_devil.name;
    });

    if(devils.length==0)
        this.devils.push(new_devil);
}

////////////////////
// Skill Type Class
////////////////////

var SkillType = function(type){

    this.name = type.name;
    this.name_tw = type.name_tw == null ? "" : type.name_tw;
    this.name_en = type.name_en == null ? "" : type.name_en;
    this.skills = type.skills;
}
SkillType.prototype.showName = function(){
    
    switch(i18n.locale){
        case 'ja': name = this.name; break;
        case 'tw': name = this.name_tw; break;
        case 'en': name = this.name_en; break;
        default: name = this.name;
    }
    if(!name)
        name = this.name;
    if(!name)
        name = '';
    return name;
}
////////////////////
// Devil Bom Class
////////////////////

function DevilBom(devil, d1, d2){

    var child1 = d1==null?null:new DevilBom(d1);
    var child2 = d2==null?null:new DevilBom(d2);

    if(child1) child1.parent = this;
    if(child2) child2.parent = this;

    this.devil = devil;
    this.parent = null;
    this.child1 = child1;
    this.child2 = child2;
    this.order = 0;
    this.upgrade = false;
    this.downgrade = false;
    this.mag = 0;
    this.mag_pure = 0;
    this.collapse = false;

    this.init();
}

DevilBom.prototype.set = function(bom){

    bom.child1.parent = this;
    bom.child2.parent = this;

    this.child1 = bom.child1;
    this.child2 = bom.child2;
    this.order = bom.order;
    this.upgrade = bom.upgrade;
    this.downgrade = bom.downgrade;
    this.mag = bom.mag;
    this.mag_pure = bom.mag_pure;
}

DevilBom.prototype.unset = function(){

    this.child1 = null;
    this.child2 = null;
    this.order = 0;
    this.upgrade = false;
    this.downgrade = false;
    this.mag = 0;
    this.mag_pure = 0;
}

DevilBom.prototype.init = function(){

    if(this.child1 && this.child2){

        var devil = this.devil;
        var d1 = this.child1.devil;
        var d2 = this.child2.devil;
        
        this.order = (d1.rarity>d2.rarity) 
            ? (d1.rarity*10+d2.rarity) 
            : (d2.rarity*10+d1.rarity);
        this.upgrade = (d1.rarity < devil.rarity && d2.rarity < devil.rarity);
        this.downgrade = (d1.rarity > devil.rarity || d2.rarity > devil.rarity);

        var g = (d1.grade + d2.grade)/2;
        var A = B = 0;
        var r = (devil.rarity*2)-d1.rarity-d2.rarity;

        A = [
            //-1 ~ 4
            [5,     5,          5,          5,          5,          5],
            [5,     5,          25,         50,         0,          0],
            [250,   500,        2500,       5000,       5200,       5400],
            [0,     6000,       150000,     300000,     320000,     0],
            [0,     60000,      1500000,    3000000,    4200000,    0]
        ][devil.rarity-1][r+1];

        B = [0,0,0.3,0.45,60,75,1080,1260,14400,16200][Math.floor(devil.grade/10)];

        var mag = A + (devil.grade-g) * B;
        
        this.mag = Math.floor(mag);
    
        if(devil.rarity==5)         this.mag_pure = Math.floor(mag*0.7);
        else if(devil.rarity==4)    this.mag_pure = Math.floor(mag*0.5);
        else                        this.mag_pure = this.mag;

        if( A==0 ){
            this.mag = 0;
            this.mag_pure = 0;
        }
    }
    else{
        this.order = 0;
        this.upgrade = false;
        this.downgrade = false;
        this.mag = 0;
        this.mag_pure = 0;
    }
};

DevilBom.prototype.showMag = function(){

    return (this.mag/1).toFixed(0).toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
};


DevilBom.prototype.showMagPure = function(){

    return (this.mag_pure/1).toFixed(0).toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
};

DevilBom.prototype.caculate_mag = function(layer){

    var mag = this.mag;
    var mag1 = (this.child1?this.child1.caculate_mag(layer+1):0);
    var mag2 = (this.child2?this.child2.caculate_mag(layer+1):0);
    
    if(layer==1){
        if(mag1>mag2){  mag += mag1 + (this.child2?this.child2.caculate_mag_pure():0);   }
        else{           mag += (this.child1?this.child1.caculate_mag_pure():0) + mag2;   }
    }
    else{               mag += mag1 + mag2;                                   }

    return mag;
};

DevilBom.prototype.caculate_mag_pure = function(){

    return this.mag_pure 
        + (this.child1?this.child1.caculate_mag_pure():0)
        + (this.child2?this.child2.caculate_mag_pure():0);
};

DevilBom.prototype.showTotalMag = function(){

    var mag = this.caculate_mag(1);

    return (mag/1).toFixed(0).toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
}

DevilBom.prototype.showTotalMagPure = function(){

    var mag_pure = this.caculate_mag_pure();

    return (mag_pure/1).toFixed(0).toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
}

DevilBom.bom = function(devil, d1, d2){

    var g = (d1.grade + d2.grade)/2;

    if( ! (devil.min <= g && g < devil.max ) ){
        return null;
    }

    return new DevilBom(devil, d1, d2);
}

/////////////////////////////
// Digital Devil Data Class
/////////////////////////////

function Resource(ddd, sss){
    
    this.races = [];
    this.devils = [];
    this.skillTypes = [];
    this.skills = [];
    
    var race_data = {};
    var devil_data = {};
    var devil_array = [];
    var type_data = {};
    var skill_data = {};
    var skill_array = [];

    sss = sss.map(function(type){

        type = new SkillType(type);
        type_data[type.name] = type;

        type.skills = type.skills.map(function(skill){
            skill = new Skill(skill);
            skill.type = type;
            skill_data[skill.name] = skill;
            skill_array.push(skill);
            return skill;
        });
        return type;
    });

    //create race_data
    //convert race to Race Class
    //convert devil to Devil Class
    ddd = ddd.map(function(race){
        
        race.devils = race.devils.map(function(devil){
            return new Devil(devil);
        });
        race_data[race.name] = race;
        return new Race(race);
    });

    //replace formula's race from text to object
    ddd.forEach(function(race){

        race.formulas.forEach(function(formula){
            formula[0] = race_data[formula[0]];
            formula[1] = race_data[formula[1]];
        });
    });

    //create devil_data
    //convert devil's skill from text to object
    ddd.forEach(function(r1){

        r1.devils.forEach(function(devil, index){

            devil.race = r1;
            devil.max = devil.grade;
            devil.min = (index==r1.devils.length-1 ? 0 : r1.devils[index+1].grade);

            if(devil.skills){
                devil.skills = devil.skills.map(function(name){
                    var skill = skill_data[name];
                    if(skill){
                        skill.addDevil(devil);
                    }
                    return skill ? skill : new Skill({name:name});
                });
            }
            if(devil.skill4){
                devil.skill4 = devil.skill4.map(function(name){
                    var skill = skill_data[name];
                    if(skill){
                        skill.addDevil(devil);
                    }
                    return skill ? skill : new Skill({name:name});
                });
            }
            if(devil.skill5){
                devil.skill5 = devil.skill5.map(function(name){
                    var skill = skill_data[name];
                    if(skill){
                        skill.addDevil(devil);
                    }
                    return skill ? skill : new Skill({name:name});
                });
            }

            devil_array.push(devil);
            devil_data[devil.name] = devil;
        });

        var usage_temp = {};

        ddd.forEach(function(target){

            target.formulas.forEach(function(f){
                
                var r2 = null;

                if(f[0].name==r1.name){
                    r2 = f[1];
                }
                if(f[1].name==r1.name){
                    r2 = f[0];
                }
                if(r2){

                    if(! (target.name in usage_temp)){
                        usage_temp[target.name] = [];
                    }

                    usage_temp[target.name].push(r2);
                }
            });
        });

        r1.usage = [];

        for(name in usage_temp){
            r1.usage.push({
                target:race_data[name],
                r2s:usage_temp[name]
            })
        }
    });

    devil_array.sort(function(d1,d2){
        if(d1.grade==d2.grad2)  return 0;
        return d1.grade > d2.grade ? 1 : -1;
    });

    //create fission and fusion options
    devil_array.forEach(function(devil){
        devil.fission_options = devil.fission_formulas();
        devil.fusion_options = devil.fusion_formulas();
        devil.fission_boms = [];
        
        devil.fission_options.forEach(function(option){
             option.boms.forEach(function(bom){
                devil.fission_boms.push(bom);
             });
        });
    });

    //caculate each devil's cost

    var i=0;
    while(true&&i<10){

        var all_pass = true;
        
        devil_array.forEach(function(devil){

             //cost changed
     
            var pass = true;

            devil.fission_boms.forEach(function(bom){
                if( bom.child1.devil.cost==null || bom.child2.devil.cost==null){
                    pass = false;
                }
            });

            devil.fission_boms.sort(function(bom1, bom2){

                var cost1 = bom1.child1.devil.cost + bom1.child2.devil.cost + bom1.mag_pure;
                var cost2 = bom2.child1.devil.cost + bom2.child2.devil.cost + bom2.mag_pure;

                if(bom1.child1.devil.cost==null)  cost1 = null;
                if(bom1.child2.devil.cost==null)  cost1 = null;
                if(bom2.child1.devil.cost==null)  cost2 = null;
                if(bom2.child2.devil.cost==null)  cost2 = null;

                if(cost1==cost2) return 0;
                if(cost1==null)  return 1;
                if(cost2==null) return -1;

                return cost1 > cost2 ? 1 : -1;
            });

            //pass & caculate devil's cost
            if(devil.fission_boms.length>0){
                var bom = devil.fission_boms[0];
                var cost = bom.child1.devil.cost + bom.child2.devil.cost + bom.mag_pure;
                if(bom.child1.devil.cost==null) cost = null;
                if(bom.child2.devil.cost==null) cost = null;
                if(cost!=null && devil.cost != cost){
                    devil.cost = cost;
                    pass = false;
                }
            }
            else{
                devil.cost = 0;
            }

            if(!pass){         
                all_pass = false;
            }
        });

        i++;
        if(all_pass){
            break;
        }
    }
    
    this.races = ddd;
    this.race_data = race_data;
    this.devils = devil_array;
    this.devil_data = devil_data;
    this.skillTypes = sss;
    this.skills = skill_array;
    this.skill_data = skill_data;
    this.builder_options = [];
    this.fusion_options = [];
}

////////////////////
//      Main
////////////////////

// Initialize

var resource = [];
resource.push(new Resource(ddd_stable, skill_stable));

function setCookie(name,value)
{
    var Days = 365;
    var exp  = new Date();
    exp.setTime(exp.getTime() + Days*24*60*60*1000);
    document.cookie = name + "="+ escape (value) + ";expires=" + exp.toGMTString();
}
function getCookie(name)
{
    var arr = document.cookie.match(new RegExp("(^| )"+name+"=([^;]*)(;|$)"));
     if(arr != null) return unescape(arr[2]); return null;
}

  
const i18n = new VueI18n({
    locale: 'ja', // set locale
    messages: messages // set locale messages
});
  
var app = new Vue({
    i18n:i18n,
    el:'#app',
    data:{
        resource_id:0,
        race_id:0,
        skillType_id:0,

        //builder
        builder_rarity_options:[
            {text:"1+1", state:true, active:false},
            {text:"1+2", state:true, active:false},
            {text:"1+3", state:true, active:false},
            {text:"1+4", state:true, active:false},
            {text:"1+5", state:true, active:false},
            {text:"2+2", state:true, active:false},
            {text:"2+3", state:true, active:false},
            {text:"2+4", state:true, active:false},
            {text:"2+5", state:true, active:false},
            {text:"3+3", state:true, active:false},
            {text:"3+4", state:true, active:false},
            {text:"3+5", state:true, active:false},
            {text:"4+4", state:true, active:false},
            {text:"4+5", state:true, active:false},
            {text:"5+5", state:true, active:false}
        ],
        //fusion
        fusion_rarity_options:[
            {text:"1+1", state:true, active:false},
            {text:"1+2", state:true, active:false},
            {text:"1+3", state:true, active:false},
            {text:"1+4", state:true, active:false},
            {text:"1+5", state:true, active:false},
            {text:"2+2", state:true, active:false},
            {text:"2+3", state:true, active:false},
            {text:"2+4", state:true, active:false},
            {text:"2+5", state:true, active:false},
            {text:"3+3", state:true, active:false},
            {text:"3+4", state:true, active:false},
            {text:"3+5", state:true, active:false},
            {text:"4+4", state:true, active:false},
            {text:"4+5", state:true, active:false},
            {text:"5+5", state:true, active:false}
        ],
        
        //setting
        lang_value:0,
        lang_options:[
            {text:'日本語', value:0},
            {text:'繁體中文', value:1}
//            {text:'English', value:2},
        ],
        allow_down_grade:0,
        allow_down_grade_options:[
            {text: 'message.allow', value:1},
            {text: 'message.deny', value:0}
        ],
        allow_prevent_unload:0,
        index_main:0,
        index_main_last:0,
        index_fusion:0,
        index_fusion_last:0,
        keyword:'',
        searchBar:false,
        //orb
        orbs:[
            {'name':'ライト', icon:'images/theme/light.png', state:false},
            {'name':'ダーク', icon:'images/theme/dark.png', state:false},
            {'name':'ニュートラル', icon:'images/theme/natural.png', state:false },
            {'name':'ロー', icon:'images/theme/law.png', state:false},
            {'name':'カオス', icon:'images/theme/chaos.png', state:false}
        ],
        
        //timer
        now:null,
        gate_status_ch:false,
        gate_status_jp:false,
        gate_timer_ch:null,
        gate_timer_jp:null,
        
        //modal

        updated_at:'180424',
         
        //important for update computed's getter from setter
        computed_counter:{
            builder_target:0,
            builder_options:0,
            info_target:0,
            current_bom:0,
            fusion_target:0,
            fusion_options:0
        }
    },
    created:function(){

        var c_lang_value = getCookie('lang_value');
        
        if(c_lang_value!=null){
            this.lang_value = c_lang_value;
        }

        switch(this.lang_value){
            case '0': i18n.locale='ja';break;
            case '1': i18n.locale='tw';break;
            case '2': i18n.locale='en';break;
            default: i18n.locale='ja';break;
        }

        var c_allow_down_grade = getCookie('allow_down_grade');

        if(c_allow_down_grade!=null){
            this.allow_down_grade = c_allow_down_grade;
        }

        var c_allow_prevent_unload = getCookie('allow_prevent_unload');

        if(c_allow_prevent_unload!=null){
            this.allow_prevent_unload = c_allow_prevent_unload;
        }

        this.update_now();

        setInterval(function(){

            app.tick();

        },1000);

        //const created_stamp = new Date();

        //console.log(created_stamp - start_stamp);
    },
    updated:function(){

        //const updated_stamp = new Date();

        //console.log(updated_stamp - start_stamp);
    },
    watch:{
        lang_value:function(){

            switch(this.lang_value){
                case 0: i18n.locale='ja';break;
                case 1: i18n.locale='tw';break;
                case 2: i18n.locale='en';break;
            }

            setCookie('lang_value', this.lang_value);
        },
        allow_down_grade:function(){
            
            this.update_builder_filter();
            this.update_fusion_filter();
            
            setCookie('allow_down_grade', this.allow_down_grade);
        },
        allow_prevent_unload:function(){
            
            setCookie('allow_prevent_unload', this.allow_prevent_unload);
        },
        resource_id:function(){
            
            this.reset_builder();
            this.reset_fusion();
        }
    },
    computed:{
        resource:function(){

            return resource[this.resource_id];
        },
        races:function(){

            return this.resource.races;
        },
        devils:function(){

            return this.resource.devils;
        },
        devils_by_race:function(){

            if(this.race_id >= this.races.length)
                this.race_id = this.races.length-1;

            return this.races[this.race_id].devils;
        },
        skillTypes:function(){

            return this.resource.skillTypes;
        },
        skills:function(){

            return this.resource.skills;
        },
        skills_by_type:function(){

            if(this.skillType_id >= this.skillTypes.length)
                this.skillType_id = this.skillType.length-1;

            return this.skillTypes[this.skillType_id].skills;
        },
        builder_target:{
            get:function(){

                this.computed_counter.builder_target;
                return this.resource.builder_target;
            },
            set:function(bom){

                this.resource.builder_target = bom;
                this.computed_counter.builder_target++;
            }
        },
        builder_options:{
            get: function(){

                this.computed_counter.builder_options;
                return this.resource.builder_options;
            },
            set:function(options){

                this.resource.builder_options = options;
                this.computed_counter.builder_options++;
            }
        },
        current_bom:{
            get:function(){
                
                this.computed_counter.current_bom;
                return this.resource.current_bom;
            },
            set:function(bom){
                this.resource.current_bom = bom;
                this.computed_counter.current_bom++;
            }
        },
        fusion_target:{
            get:function(){

                this.computed_counter.fusion_target;
                return this.resource.fusion_target;
            },
            set:function(bom){

                this.resource.fusion_target = bom;
                this.computed_counter.fusion_target++;
            }
        },
        fusion_options:{
            get: function(){

                this.computed_counter.fusion_options;
                return this.resource.fusion_options;
            },
            set:function(options){

                this.resource.fusion_options = options;
                this.computed_counter.fusion_options++;
            }
        },
        info_target:{
            get:function(){

                this.computed_counter.info_target;
                return this.resource.info_target;
            },
            set:function(devil){

                this.resource.info_target = devil;
                this.computed_counter.info_target++;
            }
        },
        filtered_devils: function(){

            var keyword = this.keyword.replace(/[!@#$%^&*()-=_+\[\]{}|\\]/g,'');

            var result = [];

            if(keyword){
                result = this.devils.filter(function(d){
                    return d.name.match(keyword)||d.name_tw.match(keyword);
                });
            }

            return result;
        },
        filtered_skills: function(){

            var keyword = this.keyword.replace(/[!@#$%^&*()-=_+\[\]{}|\\]/g,'');

            var result = [];

            if(keyword){
                result = this.skills.filter(function(s){
                    return s.name.match(keyword)||s.name_tw.match(keyword);
                });
            }

            return result;
        },
        filtered_builder_options:function(){

            var options = [];
            var filters = this.builder_rarity_options;
            var allow_down_grade = this.allow_down_grade;

            this.builder_options.forEach(function(option){

                var boms = option.boms.filter(function(bom){
                    
                    var r = bom.devil.rarity;
                    var r1 = bom.child1.devil.rarity;
                    var r2 = bom.child2.devil.rarity;
                    var temp = [r1,r2].sort();
                    
                    r1 = temp[0];
                    r2 = temp[1];

                    if( allow_down_grade==0 && (r1>r||r2>r)){
                        return false;
                    }

                    return filters.filter(function(filter){
                        if(filter.active&&filter.state&&filter.text==r1+'+'+r2){
                            return true;
                        }
                    }).length > 0;
                });

                if(boms.length)
                    options.push({name:option.name,boms:boms});
            });

            return options;
        },
        filtered_fusion_options:function(){

            var options = [];
            var filters = this.fusion_rarity_options;
            var allow_down_grade = this.allow_down_grade;

            this.fusion_options.forEach(function(option){

                var formulas = [];
                
                option.formulas.forEach(function(formula){

                    var boms = formula.boms.filter(function(bom){
                    
                        var r = bom.devil.rarity;
                        var r1 = bom.child1.devil.rarity;
                        var r2 = bom.child2.devil.rarity;
                        var temp = [r1,r2].sort();
                        
                        r1 = temp[0];
                        r2 = temp[1];

                        if( allow_down_grade==0 && (r1>r||r2>r)){
                            return false;
                        }

                        return filters.filter(function(filter){
                            if(filter.active&&filter.state&&filter.text==r1+'+'+r2){
                                return true;
                            }
                        }).length > 0;
                    });

                    if(boms.length){
                        formulas.push({name:formula.name,boms:boms});
                    }
                });

                if(formulas.length){
                    options.push({devil:option.devil,formulas:formulas,active:false});
                }
            });
            
            return options;
        }
    },
    methods:{

        route:function(name, skip_update_last){
            
            var index_main = this.index_main;
            var index_fusion = this.index_fusion;

            switch(name){
                case 'fusion.devil':    index_main = 0; index_fusion = 0;   break;
                case 'fusion.fission':  index_main = 0; index_fusion = 1;   break;
                case 'fusion.fusion':   index_main = 0; index_fusion = 2;   break;
                case 'skill':           index_main = 1;                     break;
                case 'customize':       index_main = 2;                     break;
                case 'search':          index_main = 3;                     break;
                case 'setting':         index_main = 4;                     break;
                case 'last':            index_main = this.index_main_last;
                                        index_fusion = this.index_fusion_last;  break;
                default:                index_main = 0; index_fusion = 0;   break;
            }

            if(!skip_update_last){
                this.index_main_last = index_main;
                this.index_fusion_last = index_fusion;
            }

            this.index_main = index_main;
            this.index_fusion = index_fusion;
        },
        isRoute:function(name){
            
            var index_main = this.index_main;
            var index_fusion = this.index_fusion;

            switch(name){
                case 'home':            index_main = 0; index_fusion = 0;   break;
                case 'fusion.devil':    index_main = 0; index_fusion = 0;   break;
                case 'fusion.fission':  index_main = 0; index_fusion = 1;   break;
                case 'fusion.fusion':   index_main = 0; index_fusion = 2;   break;
                case 'skill':           index_main = 1;                     break;
                case 'customize':       index_main = 2;                     break;
                case 'search':          index_main = 3;                     break;
                case 'setting':         index_main = 4;                     break;
                default:                index_main = 0; index_fusion = 0;   break;
            }

            return index_main == this.index_main && index_fusion == this.index_fusion;
        },
        start_bom: function(devil){

            this.builder_target = new DevilBom(devil);
            this.current_bom = null;
            this.route('fusion.fission');
            this.list_bom(this.builder_target);
        },
        list_bom: function(bom){

            this.update_current_bom(this.current_bom==bom?null:bom);
        },
        update_current_bom:function(bom){

            this.current_bom = bom;
            this.update_builder();
        },
        choose_bom: function(bom){

            this.current_bom.set(bom);
            this.update_current_bom(null);
        },
        reset_bom:function(bom){

            bom.unset();
            this.update_current_bom(null);
        },
        reset_builder:function(){
            
            this.builder_target = null; 
            this.update_current_bom(null);
        },
        builder_rarity_option_click:function(option){

            var flag_first_down = true;
            var flag_last_down = true;

            if(option.state)
                return false;

            this.builder_rarity_options.forEach(function(opt){

                if(opt.active && opt!=option && !opt.state){
                    flag_first_down = false;
                }

                if(opt.active && opt!=option && opt.state){
                    flag_last_down = false;
                }
            });

            if(flag_first_down){
                this.builder_rarity_options.forEach(function(opt){
                    opt.state = opt==option ;
                });
            }

            if(flag_last_down){
                this.builder_rarity_options.forEach(function(opt){
                    opt.state=true;
                });
            }
        },
        update_builder:function(){
            
            if(this.current_bom){
                this.builder_options = this.current_bom.devil.fission_formulas();
            }
            else{
                this.builder_options = [];
            }
            this.update_builder_filter();
        },
        update_builder_filter:function(){
            
            var combs = {};
            var allow_down_grade = this.allow_down_grade;

            this.builder_options.forEach(function(option){

                option.boms.forEach(function(bom){

                    var r = bom.devil.rarity;
                    var r1 = bom.child1.devil.rarity;
                    var r2 = bom.child2.devil.rarity;
                    var temp = [r1,r2].sort();
                    
                    r1 = temp[0];
                    r2 = temp[1];
                    
                    if( allow_down_grade==0 && (r1>r||r2>r)){
                        //skip
                    }
                    else{
                        if(!combs[r1+'+'+r2])
                            combs[r1+'+'+r2] = r1+'+'+r2;
                    }
                    
                });
            });
            
            this.builder_rarity_options.forEach(function(option){

                if(combs[option.text]){
                    option.active=true;
                    option.state=true;
                }
                else{
                    option.active=false;
                }
            });
        },
        fusion_rarity_option_click:function(option){

            var flag_first_down = true;
            var flag_last_down = true;

            if(option.state)
                return false;

            this.fusion_rarity_options.forEach(function(opt){

                if(opt.active && opt!=option && !opt.state){
                    flag_first_down = false;
                }

                if(opt.active && opt!=option && opt.state){
                    flag_last_down = false;
                }
            });

            if(flag_first_down){
                this.fusion_rarity_options.forEach(function(opt){
                    opt.state = opt==option ;
                });
            }

            if(flag_last_down){
                this.fusion_rarity_options.forEach(function(opt){
                    opt.state=true;
                });
            }
        },
        update_fusion:function(){

            if(this.fusion_target){
                this.fusion_options = this.fusion_target.fusion_formulas();
            }
            else{
                this.fusion_options = [];
            }
            this.update_fusion_filter();
        },
        fusion: function(devil){

            this.fusion_target = devil;
            this.update_fusion();
            this.route('fusion.fusion');
        },
        reset_fusion: function(){
            
            this.fusion_target = null;
            this.update_fusion();
        },
        update_fusion_filter: function(){

            var combs = {};
            var allow_down_grade = this.allow_down_grade;
            
            this.fusion_options.forEach(function(option){
                option.formulas.forEach(function(formula){
                    formula.boms.forEach(function(bom){

                        var r = bom.devil.rarity;
                        var r1 = bom.child1.devil.rarity;
                        var r2 = bom.child2.devil.rarity;
                        var temp = [r1,r2].sort();
                        
                        r1 = temp[0];
                        r2 = temp[1];
                        
                        if( allow_down_grade==0 && (r1>r||r2>r)){
                            //skip
                        }
                        else{
                            if(!combs[r1+'+'+r2])
                                combs[r1+'+'+r2] = r1+'+'+r2;
                        }
                    });
                });
            });
            
            this.fusion_rarity_options.forEach(function(option){

                if(combs[option.text]){
                    option.active=true;
                    option.state=true;
                }
                else{
                    option.active=false;
                }
            });
        },
        update_now:function(){

            var now = new Date();
            var utc = now.getTime() + now.getTimezoneOffset() * 60000;
            this.now = new Date( utc + 9 * 3600000 );
        },
        tick:function(){

            var sec = this.now.getSeconds()+1;

            if(sec==60)
                this.update_now();
            
            this.now.setSeconds( sec );

            var next, diff, h;
            var gate_hours_ch = [0,9,12,17,19,22];    //utc+8 [8,11,16,18,21,23]
            var gate_hours_jp = [0,7,12,17,19,22];    //utc+8 [6,11,16,18,21,23]

            var h = this.now.getHours();

            next = new Date(this.now.getTime());
            next.setMinutes(0);
            next.setSeconds(0);

            for(var i=0; i<gate_hours_ch.length;i++){
                var gate_hour = gate_hours_ch[i];
                if(h<gate_hour){
                    next.setHours(gate_hour);
                    this.gate_status_ch = false;
                    break;
                }
                if(h==gate_hour){
                    next.setHours(next.getHours()+1);
                    this.gate_status_ch = true;
                    break;
                }
                if(i==gate_hours_ch.length-1){
                    gate_hour = gate_hours_ch[0];
                    next.setHours(next.getHours()+24-h+gate_hour);
                    this.gate_status_ch = false;
                    break;
                }
            }
            var diff = new Date(next.getTime() - this.now.getTime());
            this.gate_timer_ch =  (diff.getUTCHours()+':'+diff.getUTCMinutes()+':'+diff.getUTCSeconds()).replace(/\b(?=(\d{1})(?!\d))/g,'0');

            next = new Date(this.now.getTime());
            next.setMinutes(0);
            next.setSeconds(0);

            for(var i=0; i<gate_hours_jp.length;i++){

                var gate_hour = gate_hours_jp[i];
                if(h<gate_hour){
                    next.setHours(gate_hour);
                    this.gate_status_jp = false;
                    break;
                }
                if(h==gate_hour){
                    next.setHours(next.getHours()+1);
                    this.gate_status_jp = true;
                    break;
                }
                if(i==gate_hours_jp.length-1){
                    gate_hour = gate_hours_jp[0];
                    next.setHours(next.getHours()+24-h+gate_hour);
                    this.gate_status_jp = false;
                    break;
                }
            }
            diff = new Date(next.getTime() - this.now.getTime());
            this.gate_timer_jp =  (diff.getUTCHours()+':'+diff.getUTCMinutes()+':'+diff.getUTCSeconds()).replace(/\b(?=(\d{1})(?!\d))/g,'0');

            //orb
            var day = this.now.getDay();
            this.orbs[0].state = (day==1||day==6);          //light
            this.orbs[1].state = (day==2||day==6);          //dark
            this.orbs[2].state = (day==3||day==6||day==0);  //natural
            this.orbs[3].state = (day==4||day==0);          //law
            this.orbs[4].state = (day==5||day==0);          //chaos
        },
        show_devil_info:function(devil){

            //this.info_name = devil.name;
            this.info_target = devil;
            this.$root.$emit('bv::show::modal','modal_devil_info');
        },
        auto_costdown: function(bom, rarity){

            if(bom && bom.devil.rarity>rarity){

                var options = bom.devil.fission_formulas();
                var boms = [];

                options.forEach(function(option){
                    boms = boms.concat(option.boms);
                });

                boms.sort(function(bom1, bom2){
                    var cost1 = bom1.child1.devil.cost + bom1.child2.devil.cost + bom1.mag_pure;
                    var cost2 = bom2.child1.devil.cost + bom2.child2.devil.cost + bom2.mag_pure;
                    if(cost1==cost2) return 0;
                    return cost1 > cost2 ? 1 : -1;
                });

                if(boms.length>0){
                    bom.set(boms[0]);
                }

                this.auto_costdown(bom.child1, rarity);
                this.auto_costdown(bom.child2, rarity);
            }
        },
        builder_auto_costdown:function(rarity){
            if(rarity==null)
                rarity = 3;
            this.auto_costdown(this.builder_target, rarity);
            this.update_current_bom(null);
        }
    }
});

Vue.component('skill',{
    props:['skill'],
    template:'#skill-t'
});

Vue.component('skill-list',{
    props:['skills'] ,
    template:'#skill-list-t',
    data:function(){
        return {
            actives:[]
        }
    },
    watch:{
        skills:function(){
            this.actives=[];
        }
    }
});

Vue.component('devil',{
    props:['devil','usage','skill'],
    template:'#devil-t',
    methods:{
        click:function(){
            if(this.usage=='fission'){
                app.start_bom(this.devil);
            }
            if(this.usage=='builder'){
                this.$emit('click');
            }
        },
        info:function(){
            app.show_devil_info(this.devil);
        },
        isSkillAvailable:function(inherit){

            if(inherit){
                return this.skill==this.devil.skills[0] ||
                    this.devil.skill5.indexOf(this.skill)>=0;
            }
            else{
                return this.skill==this.devil.skills[1] ||
                    this.skill==this.devil.skills[2] ||
                    this.devil.skill4.indexOf(this.skill)>=0;
            }
        }
    }
});

Vue.component('devil-list',{
    props:['devils','usage','skill'] ,
    template:'#devil-list-t',
    methods:{
        click:function(devil){
            if(this.usage=='fission'){
                app.fission(devil);
            }
            if(this.usage=='builder'){
                this.start_bom(devil);
            }
        },
        fusion:function(devil){
            app.fusion(devil);
        },
        fission:function(devil){
            app.fission(devil, true);
        },
        start_bom:function(devil){
            app.start_bom(devil);
        }
    }
});

Vue.component('devil-bom',{
    props:['bom','usage'],
    template:'#devil-bom-t',
    methods:{
        click:function(){
            if(this.usage=='builder')
                this.choose_bom(this.bom);
        },
        choose_bom: function(){
            app.choose_bom(this.bom);
        },
        info:function(devil){
            app.show_devil_info(devil);
        }
    }
});

Vue.component('devil-bom-list',{
    props:['boms','usage'],
    template:'#devil-bom-list-t'
});

Vue.component('devil-bom-builder',{
    props:['bom'],
    template:'#devil-bom-builder-t',
    methods:{
        list_bom:function(bom){
            app.list_bom(bom);
        },
        reset_bom:function(bom){
            app.reset_bom(bom);
        },
        info:function(){
            app.show_devil_info(this.bom.devil);
        },
        toggle:function(){
            this.collapsed = !this.collapsed;
        },
        hasChild:function(){
            return this.bom.child1 || this.bom.child2;
        },
        isCurrent:function(){
            return this.bom ? this.bom == app.current_bom : false;
        },
        isParentCurrent:function(){
            return this.parent ? this.parent == app.current_bom : false;
        }
    },
    data:function(){
        return {collapsed: false}
    },
    computed:{
        collapsed_sign:function(){
            return this.collapsed ? '+' : '-';
        }
    }
});

Vue.component('devil-bom-options',{
    props:['options','usage'],
    template:'#devil-bom-options-t'
});

var window_before_unload = function(){
    
    if(app.allow_prevent_unload=='1'){
        return true;
    }
}